{
  "sources": [
    {
      "title": "Release notes from osmosfeed",
      "feedUrl": "https://github.com/osmoscraft/osmosfeed/releases.atom",
      "siteUrl": "https://github.com/osmoscraft/osmosfeed/releases",
      "articles": [
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.0",
          "author": null,
          "description": "Added: support an experimental template for YouTube feed 📺 Demo | Source\n\nAggregate content from any YouTube channel rss url https://www.youtube.com/feeds/videos.xml?channel_id=<replace_with_channel_id>\nVideos are embedded via iframe and loading accelerated by youtube-lite-embed\nAds are reduced thanks to YouTube's policy for embedded videos 🙃\nWorks on mobile devices with butter smooth horizontal scroll.\nCaveat: the template works only with YouTube content. You cannot mix textual RSS feed or other video sources such as Vimeo.\nChanged: Default HTML template meta tag adjusted to match convention\nChanged: sources in template data is now ordered by last update timestamp (as opposed to alphabetical)\nThank you @PiyushLosalka",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.11.0",
          "publishedOn": "2021-06-23T05:57:59.000Z",
          "wordCount": 368,
          "title": "v1.11.0"
        },
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.10.2",
          "author": null,
          "description": "Added: testing and CI/CD workflows",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.10.2",
          "publishedOn": "2021-06-01T04:39:30.000Z",
          "wordCount": 263,
          "title": "v1.10.2"
        },
        {
          "id": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.9.0",
          "author": null,
          "description": "Added: experimental support for iTunes podcast feed: Demo | Source. With this new release, you can render an audio control to play the mp3 file and display iTunes episode duration. It is \"experimental\" due to these caveats:\n\nThis feature is currently only available through custom template.\niTunes has no strict format requirement for duration. The unit is most likely seconds but can be \"hh:mm:ss\" or \"mm:ss\" for some sources. A future version may expose a human readable string to the template.\nNo image support yet. Some shows might have disabled CORS or use a relative URL for image, which forces osmosfeed to download the image during build. A future version may support it.\nYou can't republish the podcast in the feed output. Supporting this goes beyond the scope of the project at the moment.\nFixed: the articles in template data were not sorted.\nThank you @Zenigata",
          "link": "https://github.com/osmoscraft/osmosfeed/releases/tag/v1.9.0",
          "publishedOn": "2021-05-26T06:02:55.000Z",
          "wordCount": 412,
          "title": "v1.9.0"
        }
      ]
    },
    {
      "title": "CSS-Tricks",
      "feedUrl": "https://css-tricks.com/feed/",
      "siteUrl": "https://css-tricks.com",
      "articles": [
        {
          "id": "https://css-tricks.com/?p=343076",
          "author": "Chris Coyier",
          "description": "When I blogged “Making Tables With Sticky Header and Footers Got a Bit Easier” recently, I mentioned that the “stickiness” improvement was just one of the features that got better for <table>s in Chrome as part of the TablesNG upgrade…\nThe post TablesNG — Improvements to table rendering in Chromium appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://www.bram.us/2021/06/21/tablesng-improvements-to-table-rendering-in-chromium/",
          "publishedOn": "2021-06-23T21:37:14.000Z",
          "wordCount": 1325,
          "title": "TablesNG — Improvements to table rendering in Chromium"
        },
        {
          "id": "https://css-tricks.com/?p=342750",
          "author": "Ollie Williams",
          "description": "The CSS image-set() function has been supported in Chromium-based browsers since 2012 and in Safari since version 6. Support recently landed in Firefox 88. Let’s dive in and see what we can and can’t do today with image-set().…\nThe post Using Performant Next-Gen Images in CSS with image-set appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/using-performant-next-gen-images-in-css-with-image-set/",
          "publishedOn": "2021-06-23T19:10:54.000Z",
          "wordCount": 1244,
          "title": "Using Performant Next-Gen Images in CSS with image-set"
        },
        {
          "id": "https://css-tricks.com/?p=342669",
          "author": "Chris Coyier",
          "description": "PPK looks at aspect-ratio, a CSS property for layout that, for the most part, does exactly what you would think it does. It’s getting more interesting as it’s behind a flag in Firefox and Safari now, so we’ll have …\nThe post “Weak declaration” appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/weak-declaration/",
          "publishedOn": "2021-06-23T14:27:14.000Z",
          "wordCount": 629,
          "title": "“Weak declaration”"
        },
        {
          "id": "https://css-tricks.com/?p=342930",
          "author": "Chris Coyier",
          "description": "There are four keywords that are valid values for any CSS property (see the title). Of those, day to day, I’d say I see the inherit used the most. Perhaps because it’s been around the longest (I think?) but also …\nThe post inherit, initial, unset, revert appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/inherit-initial-unset-revert/",
          "publishedOn": "2021-06-22T21:20:20.000Z",
          "wordCount": 687,
          "title": "inherit, initial, unset, revert"
        },
        {
          "id": "https://css-tricks.com/?p=342634",
          "author": "Geoff Rich",
          "description": "Svelte fully supports custom elements (e.g. <my-component>) without any custom configuration or wrapper components and has a perfect score on Custom Elements Everywhere. However, there are still a few quirks you need to watch out for, especially around …\nThe post Using Custom Elements in Svelte appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/using-custom-elements-in-svelte/",
          "publishedOn": "2021-06-22T14:37:50.000Z",
          "wordCount": 3090,
          "title": "Using Custom Elements in Svelte"
        },
        {
          "id": "https://css-tricks.com/?p=342925",
          "author": "Chris Coyier",
          "description": "I’m not here to raise a shield protecting CSS utility frameworks. I don’t even particularly like the approach, myself, and nothing is above fair criticism. But fair is a key word there. I can’t tell you how many times I’ve …\nThe post If we’re gonna criticize utility-class frameworks, let’s be fair about it appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/if-were-gonna-criticize-utility-class-frameworks-lets-be-fair-about-it/",
          "publishedOn": "2021-06-22T14:33:41.000Z",
          "wordCount": 3340,
          "title": "If we’re gonna criticize utility-class frameworks, let’s be fair about it"
        },
        {
          "id": "https://css-tricks.com/?p=342887",
          "author": "Chris Coyier",
          "description": "Una is calling it the new responsive. A nod to the era we were most certainly in, the era of responsive design. Where responsive design was fluid grids, flexible media, and media queries, the new responsive is those things …\nThe post Are we in a new era of web design? What do we call it? appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://web.dev/new-responsive/",
          "publishedOn": "2021-06-21T21:22:33.000Z",
          "wordCount": 2285,
          "title": "Are we in a new era of web design? What do we call it?"
        },
        {
          "id": "https://css-tricks.com/?p=342448",
          "author": "Preethi",
          "description": "Let’s forego the usual circles and bars we typically see used in charts for more eccentric shapes. With online presentations more and more common today, a quick way to spruce up your web slides and make them stand out is …\nThe post How to Create CSS Charts With Interesting Shapes, Glyphs and Emoji appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/how-to-create-css-charts-with-interesting-shapes-glyphs-and-emoji/",
          "publishedOn": "2021-06-21T14:32:45.000Z",
          "wordCount": 1598,
          "title": "How to Create CSS Charts With Interesting Shapes, Glyphs and Emoji"
        },
        {
          "id": "https://css-tricks.com/?p=341511",
          "author": "Carter Li",
          "description": "The outline property in CSS draws a line around the outside of an element. This is quite similar to the border property, the main exception being that outline isn’t a part of the box model. It is often used for …\nThe post Using the `outline` Property as a Collapsable Border appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/using-the-outline-property-as-a-collapsable-border/",
          "publishedOn": "2021-06-18T20:38:59.000Z",
          "wordCount": 1130,
          "title": "Using the `outline` Property as a Collapsable Border"
        },
        {
          "id": "https://css-tricks.com/?p=342326",
          "author": "Chris Coyier",
          "description": "I studied the fonts of the top 1000 websites. Here’s what I learned. — Michael Li brings the data. San-serif has total dominance. “[…] it is rare to go below 10px or above 24px.” And poor <h5> always being the \n…\nThe post Links on Typography appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/links-on-typography-2/",
          "publishedOn": "2021-06-18T13:44:17.000Z",
          "wordCount": 815,
          "title": "Links on Typography"
        },
        {
          "id": "https://css-tricks.com/?p=341948",
          "author": "Louis Hoebregts",
          "description": "Clipping and masking have been around for a while now in CSS and even have pretty decent browser support. I recently worked on a project that needed to use a clipping technique for tooltips showing above links in text.\nThose …\nThe post Perfect Tooltips With CSS Clipping and Masking appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/perfect-tooltips-with-css-clipping-and-masking/",
          "publishedOn": "2021-06-17T14:45:57.000Z",
          "wordCount": 1691,
          "title": "Perfect Tooltips With CSS Clipping and Masking"
        },
        {
          "id": "https://css-tricks.com/?p=342257",
          "author": "ImageEngine",
          "description": "Images have become extremely important to the effectiveness of websites. They speak a 1000 words, attract attention, and stimulate emotions.\nHowever, web performance is also a growing problem for most websites. And images are at the heart of many web …\nThe post Start Serving Optimized Images in Vue appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/start-serving-optimized-images-in-vue/",
          "publishedOn": "2021-06-17T14:38:42.000Z",
          "wordCount": 1309,
          "title": "Start Serving Optimized Images in Vue"
        },
        {
          "id": "https://css-tricks.com/?p=342358",
          "author": "Chris Coyier",
          "description": "If you’re abhorred by using inline styles, just move that style to the class attribute! And then make sure you have CSS in place that, ya know, does what it says on the box. \nI've revolutionized CSS. pic.twitter.com/1AWCldyCwP\n— Sam \n\n…\nThe post Inline Styles as Classes (lol) appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/inline-styles-as-classes-lol/",
          "publishedOn": "2021-06-16T21:11:02.000Z",
          "wordCount": 1584,
          "title": "Inline Styles as Classes (lol)"
        },
        {
          "id": "https://css-tricks.com/?p=342630",
          "author": "Chris Coyier",
          "description": "Jim Nielsen: \nIf somebody says a comment isn’t adding any value, I would ask: to whom?\nPersonally, I’ve never liked the advice that writing obvious comments is bad practice—probably because I write obvious comments all the time.\nJim showed …\nThe post Useful and Useless Code Comments appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://blog.jim-nielsen.com/2021/useful-and-usless-code-comments/",
          "publishedOn": "2021-06-16T19:08:33.000Z",
          "wordCount": 870,
          "title": "Useful and Useless Code Comments"
        },
        {
          "id": "https://css-tricks.com/?p=342353",
          "author": "Okiki Ojo",
          "description": "The Web Animations API lets us construct animations and control their playback with JavaScript. The API opens the browser’s animation engine to developers and was designed to underlie implementations of both CSS animations and transitions, leaving the door open to …\nThe post How I Used the WAAPI to Build an Animation Library appeared first on CSS-Tricks. You can support CSS-Tricks by being an MVP Supporter.",
          "link": "https://css-tricks.com/how-i-used-the-waapi-to-build-an-animation-library/",
          "publishedOn": "2021-06-16T14:26:58.000Z",
          "wordCount": 2416,
          "title": "How I Used the WAAPI to Build an Animation Library"
        }
      ]
    },
    {
      "title": "Articles on Smashing Magazine — For Web Designers And Developers",
      "feedUrl": "https://www.smashingmagazine.com/feed/",
      "siteUrl": "https://www.smashingmagazine.com/",
      "articles": [
        {
          "id": "https://smashingmagazine.com/2021/06/new-smashing-online-workshops-frontend-ux-design/",
          "author": "hello@smashingmagazine.com (Iris Lješnjanin)",
          "description": "Frontend and design are remarkably complex these days. That’s why we invite kind, smart folks from the community to run [online workshops](https://smashingconf.com/online-workshops/) for all of us to learn together. And we have new ones coming up, and we’d like to kindly welcome you to join in.",
          "link": "https://smashingmagazine.com/2021/06/new-smashing-online-workshops-frontend-ux-design/",
          "publishedOn": "2021-06-23T13:30:00.000Z",
          "wordCount": 947,
          "title": "Smashing Online Workshops (July-October 2021)",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/1a95c729-8b29-4b44-90b0-d38183b367c0/online-workshops-2021-opt.png",
            "length": "0",
            "type": "image/png"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/automating-screen-reader-testing-macos-autovo/",
          "author": "hello@smashingmagazine.com (Cameron Cundiff)",
          "description": "Automated testing is an important part of any software project, including testing for accessibility. There are already tools for linting and integration testing accessibility, but what about end-to-end testing with real assistive technology? Since I hadn’t seen this before, I set out to build Auto VO, a driver for the VoiceOver screen reader.",
          "link": "https://smashingmagazine.com/2021/06/automating-screen-reader-testing-macos-autovo/",
          "publishedOn": "2021-06-23T09:30:00.000Z",
          "wordCount": 1350,
          "title": "Automating Screen Reader Testing On macOS Using Auto VO",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/c81018b9-c45e-4c21-9762-dff84dd2682c/automating-screen-reader-testing-macos-autovo.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/design-code-modern-approach-development-challenges/",
          "author": "hello@smashingmagazine.com (Mikołaj Dobrucki)",
          "description": "After years of innovation in both tools and processes, the struggle between design and development is still real. This article focuses on the best practices for improving the design to development processes and how cutting-edge solutions, such as UXPin powered by Merge technology, can help in facilitating the change.",
          "link": "https://smashingmagazine.com/2021/06/design-code-modern-approach-development-challenges/",
          "publishedOn": "2021-06-22T09:00:00.000Z",
          "wordCount": 2885,
          "title": "Designing With Code: A Modern Approach To Design (Development Challenges)",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/08546e48-5034-466a-a29c-08ce3827416e/uxpin-ui.png",
            "length": "0",
            "type": "image/png"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/image-text-conversion-react-tesseract-js-ocr/",
          "author": "hello@smashingmagazine.com (Ayobami Ogundiran)",
          "description": "Do you have to process data manually because it is served through images or scanned documents? An image-to-text conversion makes it possible to extract text from images to automate the processing of texts on images, videos, and scanned documents. In this article, we look at how to convert an image to text with React and Tesseract.js(OCR), preprocess images, and deal with the limitations of Tesseract (OCR).",
          "link": "https://smashingmagazine.com/2021/06/image-text-conversion-react-tesseract-js-ocr/",
          "publishedOn": "2021-06-21T14:30:00.000Z",
          "wordCount": 5358,
          "title": "Image To Text Conversion With React And Tesseract.js (OCR)",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/012f3fbe-980a-44fc-b973-a459f6d9bf1a/image-text-conversion-react-tesseract-js-ocr.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/alternative-voice-ui-voice-assistants/",
          "author": "hello@smashingmagazine.com (Ottomatias Peura)",
          "description": "Voice assistants are currently the most popular use case for voice user interfaces. However, due to the bad feedback loop resulting from voice assistants can only solve simple user tasks such as setting an alarm or playing music. In order for voice user interfaces to really break through, feedback to the user must be visual, not auditive.",
          "link": "https://smashingmagazine.com/2021/06/alternative-voice-ui-voice-assistants/",
          "publishedOn": "2021-06-18T15:00:00.000Z",
          "wordCount": 3415,
          "title": "An Alternative Voice UI To Voice Assistants",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/8ebd2c76-ebe5-4885-be3e-f9acc3608072/alternative-voice-ui-voice-assistants.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/client-side-routing-next-js/",
          "author": "hello@smashingmagazine.com (Adebiyi Adedotun)",
          "description": "Next.js has a file-based routing system in which each page automatically becomes a route based on its file name. This article will guide you through almost everything you need to know about Routing in Next.js and point you in the direction of related topics and concepts.",
          "link": "https://smashingmagazine.com/2021/06/client-side-routing-next-js/",
          "publishedOn": "2021-06-18T13:00:00.000Z",
          "wordCount": 3916,
          "title": "Client-Side Routing In Next.js",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/a51f6c83-5e1a-4535-b28a-2018310ffc3b/client-side-routing-next-js.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/img-alt-attribute-alternate-description-decorative/",
          "author": "hello@smashingmagazine.com (Eric Bailey)",
          "description": "Image placement on the modern web is highly intentional, helping to communicate the overall purpose of a page or view. This means that nearly every image you declare needs to have an alternate description.",
          "link": "https://smashingmagazine.com/2021/06/img-alt-attribute-alternate-description-decorative/",
          "publishedOn": "2021-06-17T10:30:00.000Z",
          "wordCount": 1639,
          "title": "Your Image Is Probably Not Decorative",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/95585fe9-52b8-4bd4-adac-a3580ef87b98/img-alt-attribute-alternate-description-decorative.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/complete-guide-accessibility-tooling/",
          "author": "hello@smashingmagazine.com (Nic Chan)",
          "description": "In a new short series of posts, we highlight some of the useful tools and techniques for developers and designers. Recently we’ve covered HTML Emails and SVG Generators. This time we look into different kinds of tools to help you streamline your accessibility testing process. Don’t miss the next one.",
          "link": "https://smashingmagazine.com/2021/06/complete-guide-accessibility-tooling/",
          "publishedOn": "2021-06-16T10:30:00.000Z",
          "wordCount": 4104,
          "title": "A Complete Guide To Accessibility Tooling",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/0e0ea8e6-a4ad-489c-b062-749a22d5e38e/complete-guide-accessibility-tooling.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/multiple-wordpress-sites-locally-devkinsta/",
          "author": "hello@smashingmagazine.com (Leonardo Losoviz)",
          "description": "When developing themes and plugins for WordPress, we need to test them in different environments. How can we create multiple testing sites on our computer, quickly and easily, without having to become a sysadmin?",
          "link": "https://smashingmagazine.com/2021/06/multiple-wordpress-sites-locally-devkinsta/",
          "publishedOn": "2021-06-15T10:15:00.000Z",
          "wordCount": 2381,
          "title": "Spinning Up Multiple WordPress Sites Locally With DevKinsta",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/2798d879-8878-49e3-bc0f-a1b2008210c0/devkinsta-frontpage.png",
            "length": "0",
            "type": "image/png"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/smashing-podcast-episode-39/",
          "author": "hello@smashingmagazine.com (Drew McLellan)",
          "description": "In this episode of the Smashing Podcast, we’re talking about image optimization. What steps should we follow for performant images in 2021? We talk to expert Addy Osmani to find out.",
          "link": "https://smashingmagazine.com/2021/06/smashing-podcast-episode-39/",
          "publishedOn": "2021-06-15T07:00:00.000Z",
          "wordCount": 10715,
          "title": "Smashing Podcast Episode 39 With Addy Osmani: Image Optimization",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bf1aeccc-a603-4cb3-b716-69bd0c86d33a/smashing-podcast-episode-39.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/css-javascript-requirements-accessible-components/",
          "author": "hello@smashingmagazine.com (Stephanie Eckles)",
          "description": "Spoiler alert: tooltips, modals, tabs, carousels, and dropdown menus are some of the user interface components that require more than CSS. To ensure accessibility of your interface, JavaScript is a necessary addition to accomplish focus management, respond to keyboard events, and toggle ARIA attributes.",
          "link": "https://smashingmagazine.com/2021/06/css-javascript-requirements-accessible-components/",
          "publishedOn": "2021-06-14T10:30:00.000Z",
          "wordCount": 3670,
          "title": "When CSS Isn’t Enough: JavaScript Requirements For Accessible Components",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/9982fa1e-806c-4343-9de1-eb804a48451e/css-javascript-requirements-accessible-components.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/web-design-done-well-audio/",
          "author": "hello@smashingmagazine.com (Frederick O’Brien)",
          "description": "Design often revolves around visuals, but the other senses deserve love too. In this article, we tune in to audio features that are making sites sing.",
          "link": "https://smashingmagazine.com/2021/06/web-design-done-well-audio/",
          "publishedOn": "2021-06-11T15:00:00.000Z",
          "wordCount": 1741,
          "title": "Web Design Done Well: Making Use Of Audio",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/bf0cbb26-546e-43b7-9b9a-9077259ea84b/making-use-of-audio.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/useful-frontend-boilerplates-starter-kits/",
          "author": "hello@smashingmagazine.com (Cosima Mielke)",
          "description": "We don’t need to write everything from scratch every single time. With boilerplates and starter kits, we can set up our projects faster, and get to work immediately.",
          "link": "https://smashingmagazine.com/2021/06/useful-frontend-boilerplates-starter-kits/",
          "publishedOn": "2021-06-10T15:00:00.000Z",
          "wordCount": 5149,
          "title": "Useful Front-End Boilerplates And Starter Kits",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/598e7f3e-9dca-4922-b17d-76089efab46f/25-frontend-boilerplates-starter-kits.png",
            "length": "0",
            "type": "image/png"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/three-frontend-auditing-tools/",
          "author": "hello@smashingmagazine.com (Stefan Judis)",
          "description": "Building a faster website can be a rocket task these days. There are so many things to consider, so it’s challenging to get everything right. Here are some less-known tools that might help you get there.",
          "link": "https://smashingmagazine.com/2021/06/three-frontend-auditing-tools/",
          "publishedOn": "2021-06-10T11:15:00.000Z",
          "wordCount": 867,
          "title": "Three Front-End Auditing Tools I Discovered Recently",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e21066b1-baa0-4a85-90ee-8074029d0a32/three-frontend-auditing-tools.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/has-native-css-parent-selector/",
          "author": "hello@smashingmagazine.com (Adrian Bece)",
          "description": "What makes relational selector one of the most requested features and how are we, as developers, working around not having it? In this article, we’re going to check the early spec of the :has selector, and see how it should improve the CSS workflow once it’s released.",
          "link": "https://smashingmagazine.com/2021/06/has-native-css-parent-selector/",
          "publishedOn": "2021-06-09T10:30:00.000Z",
          "wordCount": 2779,
          "title": "Meet <code>:has</code>, A Native CSS Parent Selector (And More)",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/89aef48d-9be9-45df-a7f4-775168deb8dd/has-native-css-parent-selector.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/image-optimization-book-release/",
          "author": "hello@smashingmagazine.com (Vitaly Friedman)",
          "description": "It’s here! For the last year, we’ve been working with Addy Osmani on a new Smashing Book all around image optimization. And now it’s here. Meet “Image Optimization”, our deep-dive guide to understand how to deliver high-quality images on the web fast.",
          "link": "https://smashingmagazine.com/2021/06/image-optimization-book-release/",
          "publishedOn": "2021-06-08T12:00:00.000Z",
          "wordCount": 2347,
          "title": "From AVIF to WebP: A New Smashing Book By Addy Osmani",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/b41ae541-7618-44f2-81cd-cc681c64d0d0/image-optimization-header.png",
            "length": "0",
            "type": "image/png"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/building-geocoding-app-vue-mapbox/",
          "author": "hello@smashingmagazine.com (Prince Chukwudire)",
          "description": "In this guide, we’ll be taking a general look at the concepts of forward geocoding and reverse geocoding, and will build a mini-app that applies these concepts to display specific locations, using Mapbox and Vue.js 2.6.11 to achieve this.",
          "link": "https://smashingmagazine.com/2021/06/building-geocoding-app-vue-mapbox/",
          "publishedOn": "2021-06-07T11:00:00.000Z",
          "wordCount": 2445,
          "title": "How To Build A Geocoding App In Vue.js Using Mapbox",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/20dc2361-e5a5-4a78-b380-2f5942ecfba8/building-geocoding-app-vue-mapbox.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/getting-started-webpack/",
          "author": "hello@smashingmagazine.com (Nwani Victory)",
          "description": "Modern browsers provide good support for JavaScript modules, but module bundlers such as webpack stay a critical part of the JavaScript toolchain. Let’s take a deep dive into what webpack is and how to use it in your development workflow.",
          "link": "https://smashingmagazine.com/2021/06/getting-started-webpack/",
          "publishedOn": "2021-06-04T10:00:00.000Z",
          "wordCount": 4412,
          "title": "Getting Started With Webpack",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/66ba7a41-2a37-471b-9c60-66a3162d8f05/webpack-dependency-graph-opt.png",
            "length": "0",
            "type": "image/png"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/managing-shared-state-vue3/",
          "author": "hello@smashingmagazine.com (Shawn Wildermuth)",
          "description": "Writing large-scale Vue applications can be a challenge. In this article, Shawn Wildermuth dives into the pros and cons of approaches like factories, shared objects, and using Vuex. He also explains what is coming in Vuex 5.0 that might change how we all use shared state in Vue 3.",
          "link": "https://smashingmagazine.com/2021/06/managing-shared-state-vue3/",
          "publishedOn": "2021-06-03T10:30:00.000Z",
          "wordCount": 3729,
          "title": "Managing Shared State In Vue 3",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/0a70815d-28e5-44af-8306-0e992e99593a/managing-shared-state-vue3.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/how-to-fix-cumulative-layout-shift-issues/",
          "author": "hello@smashingmagazine.com (Barry Pollard)",
          "description": "Google’s Core Web Vitals initiative has taken the SEO and Web Performance worlds by storm and many sites are busy optimizing their Page Experience to maximize the ranking factor. The Cumulative Layout Shift metric is causing trouble to a lot of sites, so let’s have a look at ways of addressing any issues for that metric.",
          "link": "https://smashingmagazine.com/2021/06/how-to-fix-cumulative-layout-shift-issues/",
          "publishedOn": "2021-06-02T12:30:00.000Z",
          "wordCount": 4585,
          "title": "How To Fix Cumulative Layout Shift (CLS) Issues",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/87fbe5f9-d311-4542-a3f0-14e860415946/cumulative-layout-shift-issues.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/front-end-performance-online-store-jewellerybox/",
          "author": "hello@smashingmagazine.com (Jennifer Brehm)",
          "description": "Getting a good performance score from Google is hard for any website — but doing so for an online store is even harder. We achieved green scores — even several for mobile. Here is how we did it.",
          "link": "https://smashingmagazine.com/2021/06/front-end-performance-online-store-jewellerybox/",
          "publishedOn": "2021-06-02T10:30:00.000Z",
          "wordCount": 5663,
          "title": "Improving The Performance Of An Online Store (Case Study)",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/8a350bf5-9114-420c-b587-fee03ea4acb6/jewellerybox-uk-online-store-scipioerp.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/smashing-podcast-episode-38/",
          "author": "hello@smashingmagazine.com (Drew McLellan)",
          "description": "In this episode, we’re talking about React performance. What factors slow our React apps down, and how can we fix it? Drew McLellan talks to expert Ivan Akulov to find out.",
          "link": "https://smashingmagazine.com/2021/06/smashing-podcast-episode-38/",
          "publishedOn": "2021-06-01T14:00:00.000Z",
          "wordCount": 7321,
          "title": "Smashing Podcast Episode 38 With Ivan Akulov: Why Is My React App Slow?",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/6db8029d-7039-4beb-b787-f3a0df852f12/smashing-podcast-episode-38.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/06/currency-convertor-exchangeratesapi/",
          "author": "hello@smashingmagazine.com (Leonardo Losoviz)",
          "description": "Amazon allows visitors to display prices in their own currency. Thanks to *ExchangeRatesApi.io*, we can do the same for our online shops, providing a better experience to our customers. Let’s find out how.",
          "link": "https://smashingmagazine.com/2021/06/currency-convertor-exchangeratesapi/",
          "publishedOn": "2021-06-01T09:00:00.000Z",
          "wordCount": 1513,
          "title": "Setting Up A Currency Convertor With ExchangeRatesApi.io",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/3ce4b3b1-3ae6-4371-8aaf-d72da3b69fc5/4-exchange-rate-api-bsa.png",
            "length": "0",
            "type": "image/png"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/05/desktop-wallpaper-calendars-june-2021/",
          "author": "hello@smashingmagazine.com (Cosima Mielke)",
          "description": "What could be a better way to welcome June than with some colorful inspiration? Well, we might have something for you: wallpapers created with love by artists and designers from across the globe.",
          "link": "https://smashingmagazine.com/2021/05/desktop-wallpaper-calendars-june-2021/",
          "publishedOn": "2021-05-31T11:30:00.000Z",
          "wordCount": 2772,
          "title": "Happy June Vibes For Your Screen (2021 Desktop Wallpapers Edition)",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/374464b5-093e-4ca2-9397-6f26c83756d4/june-20-summer-coziness-preview-opt.png",
            "length": "0",
            "type": "image/png"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/05/commenting-system-wysiwyg-editor/",
          "author": "hello@smashingmagazine.com (Shalabh Vyas)",
          "description": "In this article, we’ll be re-using the foundational WYSIWYG Editor built in the first article to build a commenting system for a WYSIWYG Editor that enables users to select text inside a document and share their comments on it. Let’s dig in!",
          "link": "https://smashingmagazine.com/2021/05/commenting-system-wysiwyg-editor/",
          "publishedOn": "2021-05-28T11:00:00.000Z",
          "wordCount": 10593,
          "title": "Adding A Commenting System To A WYSIWYG Editor",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/ec39e154-d3d3-4a12-91fd-f0c068cd5247/commenting-system-wysiwyg-editor.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/05/useful-vs-code-extensions-web-developers/",
          "author": "hello@smashingmagazine.com (Cosima Mielke)",
          "description": "Meet useful Visual Studio Code extensions for web developers: little helpers to minimize slow-downs and frustrations, and boost developer’s workflow along the way. With auto log messages, auto code formatting, file utils, file labels, code snippets, highlight brackets, tags, indents and workspaces, onboarding and remote SSH.",
          "link": "https://smashingmagazine.com/2021/05/useful-vs-code-extensions-web-developers/",
          "publishedOn": "2021-05-27T13:30:00.000Z",
          "wordCount": 4050,
          "title": "Useful VS Code Extensions For Front-End Developers",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/2c5dbb73-94e1-486f-9daa-351699faaa2d/peacock-extension.png",
            "length": "0",
            "type": "image/png"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/05/build-launch-responsive-websites-editorx/",
          "author": "hello@smashingmagazine.com (Miroslav Bekyarov)",
          "description": "While web builders have been around for a long time, it wasn’t until recently that they became practical for professional use. Closing the gap between design and code has become the north star for many companies and we are seeing a wave of tools that deliver on this promise.",
          "link": "https://smashingmagazine.com/2021/05/build-launch-responsive-websites-editorx/",
          "publishedOn": "2021-05-27T09:30:00.000Z",
          "wordCount": 2842,
          "title": "How To Build And Launch Powerful Responsive Websites With Editor X",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/e3eaf20c-08e9-4f1c-829b-f0bbd7309e0d/21-build-launch-responsive-websites-editorx.png",
            "length": "0",
            "type": "image/png"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/05/accessible-svg-patterns-comparison/",
          "author": "hello@smashingmagazine.com (Carie Fisher)",
          "description": "Discover which SVG patterns we should avoid and which patterns are the most inclusive when comparing different combinations of OSs, browsers, and screen readers.",
          "link": "https://smashingmagazine.com/2021/05/accessible-svg-patterns-comparison/",
          "publishedOn": "2021-05-26T13:20:00.000Z",
          "wordCount": 1750,
          "title": "Accessible SVGs: Perfect Patterns For Screen Reader Users",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/35bf2e3a-ae5b-49a3-843a-318b4c81f5af/accessible-svg-patterns.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        },
        {
          "id": "https://smashingmagazine.com/2021/05/undoing-mistakes-git-part2/",
          "author": "hello@smashingmagazine.com (Tobias Günther)",
          "description": "Mistakes. These cruel villains do not even stop at the beautiful world of software development. But although we cannot avoid making mistakes, we can learn to undo them! This post will show the right tools for your daily work with Git.",
          "link": "https://smashingmagazine.com/2021/05/undoing-mistakes-git-part2/",
          "publishedOn": "2021-05-25T14:00:00.000Z",
          "wordCount": 2337,
          "title": "A Guide To Undoing Mistakes With Git (Part 2)",
          "enclosure": {
            "url": "http://cloud.netlifyusercontent.com/assets/344dbf88-fdf9-42bb-adb4-46f01eedd629/211042ae-7a72-42ba-804e-9f8132815200/undoing-mistakes-git-part1.jpg",
            "length": "0",
            "type": "image/jpg"
          }
        }
      ]
    },
    {
      "title": "freeCodeCamp.org",
      "feedUrl": "https://www.freecodecamp.org/news/rss/",
      "siteUrl": "https://www.freecodecamp.org/news",
      "articles": [
        {
          "id": "605abca5687d62084bf6b7cd",
          "author": null,
          "description": "Data Analysis is the process of exploring, investigating, and gathering insights from data using statistical measures and visualizations.  The objective of data analysis is to develop an understanding of data by uncovering trends, relationships, and patterns. Data analysis is both a science and an art. On the one hand it",
          "link": "https://www.freecodecamp.org/news/exploratory-data-analysis-with-numpy-pandas-matplotlib-seaborn/",
          "publishedOn": "2021-06-24T00:11:01.000Z",
          "wordCount": 8365,
          "title": "What is Data Analysis? How to Visualize Data with Python, Numpy, Pandas, Matplotlib &amp; Seaborn Tutorial"
        },
        {
          "id": "6072ffd4d5756f080ba98b27",
          "author": null,
          "description": "Over the last few years, microservices have gone from an overhyped buzzword to something you should understand as a software engineer.  According to an O'Reilly developer survey in 2020:  61% of companies have been using microservices in the last year29% say at least half of their company systems are built",
          "link": "https://www.freecodecamp.org/news/microservices-architecture-for-humans/",
          "publishedOn": "2021-06-23T21:52:08.000Z",
          "wordCount": 2975,
          "title": "Microservices Architecture – Explained in Plain English"
        },
        {
          "id": "60d36eb66e1a1407b6b0b16d",
          "author": null,
          "description": ".NET is a popular software framework developed by Microsoft. We just released a course on the freeCodeCamp.org YouTube channel that will teach you how to create a REST API end-to-end from scratch using the latest .NET 5 innovations and Visual Studio Code. The course uses the C# programming language.",
          "link": "https://www.freecodecamp.org/news/create-a-rest-api-with-dot-net-5-and-c-sharp/",
          "publishedOn": "2021-06-23T18:08:14.000Z",
          "wordCount": 60401,
          "title": "Create a REST API with .NET 5 and  C#"
        },
        {
          "id": "60a406bd906c5207e3a7dfcb",
          "author": null,
          "description": "In this article you will learn how to create a great technical video course. I run the freeCodeCamp.org YouTube channel where we post technical courses from a variety of contributors. Video courses that follow the guidelines in this article are often a good fit for freeCodeCamp's channel. How to",
          "link": "https://www.freecodecamp.org/news/how-to-create-a-great-technical-course/",
          "publishedOn": "2021-06-23T17:19:24.000Z",
          "wordCount": 2330,
          "title": "How to Create a Great Technical Course"
        },
        {
          "id": "60d2323d6e1a1407b6b0ac4f",
          "author": null,
          "description": "Web scraping lets you collect data from web pages across the internet. It's also called web crawling or web data extraction.  PHP is a widely used back-end scripting language for creating dynamic websites and web applications. And you can implement a web scraper using plain PHP code.  But since we",
          "link": "https://www.freecodecamp.org/news/web-scraping-with-php-crawl-web-pages/",
          "publishedOn": "2021-06-22T21:11:53.000Z",
          "wordCount": 2770,
          "title": "Web Scraping with PHP – How to Crawl Web Pages Using Open Source Tools"
        },
        {
          "id": "60cac8ff4dc1a607ed7b4592",
          "author": null,
          "description": "There’s a special syntax you can use in JavaScript that makes working with promises easier. It's called “async/await\", and it’s surprisingly straightforward to understand and use.  In this article, we'll discuss:  What are asynchronus functions? How promises work in JavaScript Async/Await basics How to use",
          "link": "https://www.freecodecamp.org/news/how-to-use-async-await-write-better-javascript/",
          "publishedOn": "2021-06-22T16:24:37.000Z",
          "wordCount": 1432,
          "title": "How to Use Async/Await to Write Better JavaScript Code"
        },
        {
          "id": "60c13e71d3126007592d5be2",
          "author": null,
          "description": "The 100 Days of Code challenge is very popular among new coders and developers looking to level up their skills. It's so popular that our Discord server has an entire channel dedicated to it.  By popular demand, we recently built a Discord bot that helps people track their progress in",
          "link": "https://www.freecodecamp.org/news/how-to-build-a-100-days-of-code-bot-for-discord-using-typescript-and-mongodb/",
          "publishedOn": "2021-06-22T16:20:36.000Z",
          "wordCount": 7385,
          "title": "How to Use TypeScript and MongoDB to Build a 100 Days of Code Discord Bot"
        },
        {
          "id": "60cfff5a4dc1a607ed7b5e58",
          "author": null,
          "description": "Do you have a story idea that you'd like to turn into a novel? How about adding visual appeal and interactivity to that novel?  A Visual Novel might be the game genre you are looking for. And this tutorial is here to help set you up in 10 minutes, with",
          "link": "https://www.freecodecamp.org/news/use-python-to-create-a-visual-novel/",
          "publishedOn": "2021-06-22T16:18:29.000Z",
          "wordCount": 1611,
          "title": "How to Use Python to Create a Visual Novel Game in 10 Minutes"
        },
        {
          "id": "60c81f774dc1a607ed7b2f66",
          "author": null,
          "description": "I've been using Vim since the first year I started coding. For all the IDEs/editors that I have used, the Vim plugin is always the very first plugin that I install. I know that Vim can be challenging to work in for people who are not familiar with it.",
          "link": "https://www.freecodecamp.org/news/how-to-exit-vim/",
          "publishedOn": "2021-06-21T21:52:43.000Z",
          "wordCount": 1785,
          "title": "How to Exit Vim – Vim Save and Quit Command Tutorial"
        },
        {
          "id": "60bce157acb62507dd1d9f11",
          "author": null,
          "description": "When you're working with Python lists, you often need to combine data from multiple lists. So how do you do that? In this tutorial, we'll see the different ways you can combine data from multiple lists. We'll also learn how the list methods append() and extend() work through simple examples.",
          "link": "https://www.freecodecamp.org/news/python-list-methods-append-vs-extend/",
          "publishedOn": "2021-06-21T21:25:11.000Z",
          "wordCount": 1085,
          "title": "Python List Methods – append( ) vs extend( ) in Python Explained with Code Examples"
        }
      ]
    },
    {
      "title": "DEV Community",
      "feedUrl": "https://dev.to/feed/tag/node",
      "siteUrl": "https://dev.to",
      "articles": [
        {
          "id": "https://dev.to/joepurnell1/dipping-toes-into-kafka-and-node-49de",
          "author": "Joe Purnell",
          "description": "Some upcoming work is on the horizon which I need to work with something I've not had the pleasure before - Kafka.\nI thought it best to try out Kafka on my own terms using technologies I'm comfortable with before going into the real world and breaking something in production. \nTwo thoughts knocked around:\nI wasn't concerned with configuring Kafka itself\nI wanted to use Node to communicate with Kafka\nAs I wasn't too concerned with the configuration of Kafka itself I decided to use this handy blog post from baeldung.com where I was walked through the steps needed to get an instance of Kafka running locally via docker. \nTask one was done ✅\nWith that out the way it was time to start communicating with the Kafka instance. Kafka is a framework for streaming data - messages are posted to Kafka gr…",
          "link": "https://dev.to/joepurnell1/dipping-toes-into-kafka-and-node-49de",
          "publishedOn": "2021-06-23T21:37:30.000Z",
          "wordCount": 1278,
          "title": "Dipping toes into Kafka and Node"
        },
        {
          "id": "https://dev.to/masteringjs/setting-the-request-method-with-axios-27n0",
          "author": "Mastering JS",
          "description": "Axios is our recommended JavaScript HTTP client. While we are opposed to unnecessary outside dependencies, Axios has several advantages over fetch():\nAxios is isomorphic, fetch is not\nAxios throws an error when a request fails\nAutomatic JSON and Form-Encoded Serialization and Parsing\nInterceptors and instances\nAnother reason is that Axios has neat helper methods that allow you to set the request method, like GET or POST. For example, below is how you can send an HTTP GET request with Axios.\nconst axios = require('axios');\n\nconst res = await axios.get('https://httpbin.org/get?answer=42');\n\nres.data.args; // { answer: 42 }\n\nWant to send a POST request? That's easy, just change get() for post() and pass the request body as the 2nd parameter.\nconst res = await axios.post('https://httpbin.org/post', { hello: 'world' });\n\nres.data.json; // { hello: 'world' }\n\nAxios as a Function\n\n\nIf you prefer the named parameters approach that fetch() uses, you can also set the request method by setting the method option as shown below.\nlet res = await axios({\n  method: 'GET',\n  url: 'https://httpbin.org/get?answer=42'\n});\n\nres.data.args; // { answer: 42 }",
          "link": "https://dev.to/masteringjs/setting-the-request-method-with-axios-27n0",
          "publishedOn": "2021-06-23T19:01:56.000Z",
          "wordCount": 560,
          "title": "Setting the Request Method with Axios"
        },
        {
          "id": "https://dev.to/aws-builders/introduction-to-claudia-js-4cap",
          "author": "Salah Elhossiny",
          "description": "What is Claudia.js?\n\n\nClaudia.js is a tool designed to simplify deployment of Node.js projects to AWS Lambda and API Gateway. It automates deployment tasks so you don’t need to worry about introducing errors and configures everything the way you would expect it to be set up out of the box.\nAccording to the official website, Claudia’s primary objective is to help JavaScript developers get started using Lambda microservices easily so they can “focus on solving important business problems instead of dealing with AWS deployment workflows.”\nIn this section, we’ll walk you through setting up an example Node.js and Express.js app to show Claudia.js in action.\nClaudia.js is available on npm. The simplest way to use Claudia.js is to install it as a global utility:\n\nnpm install -g claudia\n\n\nInstall the Express.js app generator using npm:\n\nnpm install express-generator -g\n\nexpress claudia-demo\n\ncd claudia-demo\n\nnpm i\n\n\nThe Express.js app will be hosted by a Lambda function, so it needs a handler to send data between the app and the API Gateway. This is where Claudia.js comes in. Claudia uses aws-serverless-express to generate a helper function to interface between API Gateway requests and Express.js requests and responses.\nExecute the command below in your project directory. If you have renamed your Express.js application module, replace app with the name of the main Express.js application module:\n$ claudia generate-serverless-express-proxy --express-module\napp\n\nYour app is now ready to go live:\n\nclaudia create --handler lambda.handler \\ \n   --deploy-proxy-api \\ \n   --region us-east-1 \n\n\n Claudia",
          "link": "https://dev.to/aws-builders/introduction-to-claudia-js-4cap",
          "publishedOn": "2021-06-23T14:34:18.000Z",
          "wordCount": 668,
          "title": "Introduction to Claudia.js"
        },
        {
          "id": "https://dev.to/karanpratapsingh/introduction-to-go-fiber-2m0a",
          "author": "Karan Pratap Singh",
          "description": "What is go fiber?\n\n\nFiber is a web framework for Go similar to Mux. But it's heavily inspired by Express and that makes it perfect to work with for node developers.\nIt is built on top of Fasthttp engine, here are some benchmarks. It also has quite a low memory allocation overhead. For example while writing this article it only took around only ~16mb of memory, which was amazing!\nIn this article let's implement very simple mock api routes to get a feel of the Fiber framework\nThe code from the article is available in this repository\nYou can install go directly on your system by installing the binary from go docs https://golang.org/doc/install\n\n(optional)\nPersonally, I like to use docker so I don't have to install anything on my system\nLet's pull the golang docker image\ndocker pull golang\n\nCr…",
          "link": "https://dev.to/karanpratapsingh/introduction-to-go-fiber-2m0a",
          "publishedOn": "2021-06-23T11:33:07.000Z",
          "wordCount": 1339,
          "title": "Go Fiber, performant alternative to Express"
        },
        {
          "id": "https://dev.to/rusty_xx/best-way-to-store-images-on-server-3bck",
          "author": "Grey_W I N D",
          "description": "I am an amateur in node and currently working on a realistic e-commerce project with mern-stack for my portfolio. And I have a problem on how to store images on node-express server. I have searched the web and found out that multer is quite good but it saves on my computer, I want to know from y'all here what methods you use to store your images whenever you are making an ecommerce website for a client. \nThank you...",
          "link": "https://dev.to/rusty_xx/best-way-to-store-images-on-server-3bck",
          "publishedOn": "2021-06-23T09:21:50.000Z",
          "wordCount": 649,
          "title": "Best way to store images on server"
        },
        {
          "id": "https://dev.to/innocentcoder/top-7-popular-npm-packages-45n7",
          "author": "Innocent Coder",
          "description": "Node.Js Applications Benefit From More Than A Million Open-Source Packages Available In The NPM Package Registry.\n.env file into process.env. storing configuration in the environment eparate from code is based on the twelve-factor app methodology.\n\nbcrypt is a library that help youeasily hash password and compare\n\nuuid is a unique random ids values generator. it generates strong random values \n\naxios is a popular promise based http client for the browser and\n\nsocket.io enables realtime bi-directional communication between web clients and servers \n\nmoment.js is a data library for parsing, validating, manipulating\n\nloadsh is very useful, when working with numbers, array, objects,\n\nFollow on instagram for more content like this:- https://instagram.com/innocentcoderr/\nNote:- visit my youtube channel for frontend tutorials\nsubscribe to my youtube channel :- https://www.youtube.com/channel/UCR64vQptythbJ1SmI-ub0Rg\nResent post :- \nMy Secret Design Resources\nInnocent Coder ・ Jun 11 ・ 2 min read\n#webdev\n        #design\n        #javascript\n        #discuss",
          "link": "https://dev.to/innocentcoder/top-7-popular-npm-packages-45n7",
          "publishedOn": "2021-06-23T08:22:00.000Z",
          "wordCount": 537,
          "title": "Top 7 Popular Npm Packages"
        },
        {
          "id": "https://dev.to/usmanaziz/excel-automation-in-python-java-c-node-js-php-and-android-1d73",
          "author": "Usman Aziz",
          "description": "Excel automation has emerged as a powerful solution in various business use cases. Automated generation of data and Excel spreadsheets have been adopted in various domains. In this post, I am just listing a few useful blog posts that cover Excel automation and provide basic as well as advanced knowledge of how to create Excel files using popular programming languages such as Python, Java, C#, Node.js and PHP. Here we go:\nCreate Excel Files using Java\nCreate MS Excel Files using C#\nCreate Excel Files using Python\nCreate Excel Files in Node.js Applications\nCreate Excel Files using PHP\nCreate Excel Files in Android Programmatically\nCheers!",
          "link": "https://dev.to/usmanaziz/excel-automation-in-python-java-c-node-js-php-and-android-1d73",
          "publishedOn": "2021-06-23T04:34:46.000Z",
          "wordCount": 461,
          "title": "Excel Automation in Python, Java, C#, Node.js, PHP and Android"
        },
        {
          "id": "https://dev.to/gabrielle123/node-o-guia-do-mochileiro-das-galaxias-314n",
          "author": "Gabrielle Lima",
          "description": "Atualmente Node é uma runtime muito usada nos back-ends, também possuindo uma curva de aprendizado relativamente fácil, sendo assim gostaria de ajudar quem quer começar em NodeJS ou até mesmo Javascript, pois estão diretamente ligados!\nJavascript Ninja\nCurso de Javascript e Typescript do básico ao avançado\n\n\n\n  \n  \n  Formação Nodejs\n\n\nFormação Nodejs\nJavascript Completo ES6+\nJavaScript e jQuery\nNode para Iniciantes\nFundamentos JS\nNão consegui encontrar um link para esse curso, mas é do site da Pirple. Aborda Nodejs sem frameworks!\nRocketseat\nNLW",
          "link": "https://dev.to/gabrielle123/node-o-guia-do-mochileiro-das-galaxias-314n",
          "publishedOn": "2021-06-23T03:54:31.000Z",
          "wordCount": 533,
          "title": "Node: O guia do mochileiro das galáxias"
        },
        {
          "id": "https://dev.to/darraghor/8-must-have-eslint-plugins-for-your-node-js-application-3a5m",
          "author": "Darragh O'Riordan",
          "description": "Using Eslint in your project is an easy way to reduce those low-value, subjective code style comments from your pull requests.\nIt will also prevent real bugs in typescript and javascript through static analysis.\nI’ll explain why it’s so important to use ESLint on your application and I’ll describe the plugins I always add to every new NodeJs application.\nI use ESLint on all my professional work to ensure consistency for the entire team and to make sure we’re writing somewhat standard typescript/javascript.\nI also use it on all my personal projects because it’s like having an additional senior dev watching my back every time I commit code.\nHere’s a list of the plugins I use on all my projects and I’ve added some additional notes about plugins I don’t find useful.\nMost ESLint rules are subje…",
          "link": "https://dev.to/darraghor/8-must-have-eslint-plugins-for-your-node-js-application-3a5m",
          "publishedOn": "2021-06-23T00:00:00.000Z",
          "wordCount": 2243,
          "title": "8 must-have ESlint plugins for your Node.js application"
        },
        {
          "id": "https://dev.to/mr_victor/the-history-of-javascript-1fp3",
          "author": "Victor Ikechukwu",
          "description": "Nowadays JavaScript is everywhere 🌍\nHello 👋, Beautiful Coders on the internet 😃. In this article, I would share with you a quick yet comprehensive overview of how the most popular and widely used programming language in the world evolved to be what it is today.\nOver the years JavaScript has become the most popular and versatile programming language. Powering over 97% of the web. As a web developer knowing the history of the most popular and in-demand programming language is a plus that will help enhance your understanding of the language.\nBack in May 1995, the internet was becoming popular. The web back then was just static pages that were often text-heavy and ugly 😌.\nthe best ones had images floated to the left or right. Not exciting when you compare it to the web today 🤔\nThe Web nee…",
          "link": "https://dev.to/mr_victor/the-history-of-javascript-1fp3",
          "publishedOn": "2021-06-22T23:35:48.000Z",
          "wordCount": 1928,
          "title": "The History Of JavaScript ⌛"
        },
        {
          "id": "https://dev.to/joeholmes/how-to-create-a-telegram-bot-with-node-js-and-sanity-1cjk",
          "author": "Joe Holmes",
          "description": "Of the many platforms that have seen a surge in use over the past year, privacy-focused chat app Telegram is among the most successful. In April 2020, Telegram announced it hit 400 million monthly users. It now plans to reach a billion by 2022.\nIf you're a privacy advocate, beginner developer, or simply like chatting with your friends, creating Telegram chatbots is a great way to practice coding and build something cool. The platform is only getting more popular, so knowledge of the Telegram API is a great skill to have!\nIn this tutorial, we'll build a simple chatbot in Telegram using NodeJS and Replit. It will send selected memes from our group chat back to an instance of Sanity studio, where we can save them and publish them to a blog.\nThere are plenty of options for an aspiring chatbot …",
          "link": "https://dev.to/joeholmes/how-to-create-a-telegram-bot-with-node-js-and-sanity-1cjk",
          "publishedOn": "2021-06-22T22:10:25.000Z",
          "wordCount": 3142,
          "title": "How to Create a Telegram Bot with Node.js and Sanity"
        },
        {
          "id": "https://dev.to/maximization/why-storing-files-in-the-database-is-considered-bad-practice-4a49",
          "author": "Maxim Orlov",
          "description": "This article was originally published a day earlier at https://maximorlov.com/why-storing-files-database-bad-practice/\nYou're already storing structured data in the database, it seems only logical to store files in there as well.\nSo you look up how to save files in MongoDB (or PostgreSQL, MySQL, etc.), only to find out that storing files in the database is considered bad practice.\nOther web developers are saying that you shouldn't store files in the database, and they'll frown upon you if you ask them how to.\nBut nobody tells you why...\nIs it because it looks bad to have a very long base64 string in the database?\nThere has to be more to it than that.\nBy the end of this article, you'll find out why saving files in the database is considered a bad practice.\nYou will discover common downsides…",
          "link": "https://dev.to/maximization/why-storing-files-in-the-database-is-considered-bad-practice-4a49",
          "publishedOn": "2021-06-22T21:10:59.000Z",
          "wordCount": 2061,
          "title": "Why Storing Files in the Database Is Considered Bad Practice"
        }
      ]
    },
    {
      "title": "DEV Community",
      "feedUrl": "https://dev.to/feed/tag/security",
      "siteUrl": "https://dev.to",
      "articles": [
        {
          "id": "https://dev.to/wireless90/process-injection-process-hollowing-52m1",
          "author": "wireless90",
          "description": "Code sample in github\nUnderstanding one of the the Process Hollowing technique used by Malware Authors\n\n[The gif above takes awhile (30 sec) to load]\nInjecting TvnViewer.exe into notepad++.exe\n[+] Creating Victim Process notepad++.exe\n        [*] Successfully created victim process notepad++.exe\n[+] Retrieving Thread Handle of notepad++.exe\n        [*] Thread Handle at  0x2E0\n[+] Allocating unmanaged memory for ThreadContext of notepad++.exe\n[+] Retrieving ThreadContext of notepad++.exe\n[+] Retrieving ImageBase Address of notepad++.exe\n        [*] notepad++.exe's ImageBase Address is 0xA5A7162010\n[+] Allocating unmanaged memory for notepad++.exe's ImageBase\n[+] Reading ImageBase from notepad++.exe's ImageBase Address\n        [*] ImageBase is 0xA5A7162010\n[+] Unmapping notepad++.exe's Image…",
          "link": "https://dev.to/wireless90/process-injection-process-hollowing-52m1",
          "publishedOn": "2021-06-23T13:21:10.000Z",
          "wordCount": 3669,
          "title": "Process Injection (Process Hollowing)"
        },
        {
          "id": "https://dev.to/octopus/using-azure-key-vault-with-octopus-4e1n",
          "author": "Mark Harrison",
          "description": "I recently wrote about extending the functionality of Octopus to integrate with HashiCorp Vault using step templates. Afterwards, several people asked if I plan to create step templates to integrate with other secret managers.\nIn this post, I walk through a new step template, Azure Key Vault - Retrieve Secrets, which is designed to retrieve secrets from an Azure Key Vault for use in your deployments or runbooks.\n\n\n\nThis post assumes some familiarity with custom step templates and the Octopus Community Library. \nIn addition, this post doesn't go into great detail about Azure Key Vault concepts or how to set it up. You can learn more by reading the Azure Key Vault basic concepts guide from Microsoft.\nThe step template in this post retrieves secrets from an Azure Key Vault using the Az.KeyVau…",
          "link": "https://dev.to/octopus/using-azure-key-vault-with-octopus-4e1n",
          "publishedOn": "2021-06-23T11:31:12.000Z",
          "wordCount": 1230,
          "title": "Using Azure Key Vault with Octopus"
        },
        {
          "id": "https://dev.to/graphqleditor/damn-vulnerable-graphql-application-1jf5",
          "author": "Tomek Poniatowicz",
          "description": "Usually in these when I write about some library or app I try to highlight its strengths. Well this time I’m going to do the complete opposite and talk about weaknesses. Rest assured it won't be some scorching review, because we’re looking at Damn Vulnerable GraphQL Application where weaknesses are completely intentional and exploiting them is the whole point.\nAs for why it's fairly obvious, as GraphQL continues to grow and become more popular so too do the concerns about its vulnerabilities. After all, if you want to use it for your app you probably want it to be secure. So yes Damn Vulnerable GraphQL Application is full of weaknesses by design, it's meant to test GraphQL’s safety against various attacks. Let’s look at these types of attacks (or scenarios) you can try out:\nBatch Query Att…",
          "link": "https://dev.to/graphqleditor/damn-vulnerable-graphql-application-1jf5",
          "publishedOn": "2021-06-23T08:24:42.000Z",
          "wordCount": 897,
          "title": "Damn Vulnerable GraphQL Application"
        },
        {
          "id": "https://dev.to/dailydevtips1/top-5-password-managers-for-mac-3dmc",
          "author": "Chris Bongers",
          "description": "The first thing I install is a password manager on every new device. I have so many accounts I want to keep safe and secure. The only way to do this is a good password manager.\nToday's article will walk you through my top 5 password managers for Mac.\nTL;DR: I'm currently using 1Password as my password manager. It has an excellent user experience.\nYou might wonder why you should use a password manager, and I've written down some advantages that are trademarks of every password manager.\nSafely store passwords and notes in a vault\nGenerate safe passwords on the fly\nWatch passwords, keep track of leaked passwords\nI'm currently using 1Password as my password manager for Mac and iPhone. To me, it has a lot of awesome features like:\n\nFamily account and vault\nTravel mode (remove accounts for x time)\nTwo-factor for certain websites\nApps for all browsers and devices\n1Password is a paid application and starts at \\$2.99 per month.\nCheck out 1Password\nAt the company, we are using LastPass, and it's a good second choice for me personally as well.\n\nLocal Encryption\nGreat team management\nEmergency backup\nApps for all browsers and devices\nDark web monitoring\nLastPass has a free mode, so great option to start with.\nView LastPass for Mac\nDashlane is a super popular free-tiered option as your new password manager.\n\nAuto logins\nAlert for account breaches\nEmergency contact mode\nVPN wifi protection\nU2F authentication\nGet Dashlane for Mac\nThis free option has unlimited storage, which is unheard of for these kinds of systems.\n\nFamily plan\nPassword analysis\nSecure file sharing\nOpen-source\nGet bitwarden now\nAnd the last option is keeper, which comes as a fair prices option.\n\nBreachWatch, alert for breaches\nEncrypted private messenger\nImport existing passwords\nPassword sharing\nTry out Keeper\nThank you for reading my blog. Feel free to subscribe to my email newsletter and connect on Facebook or Twitter",
          "link": "https://dev.to/dailydevtips1/top-5-password-managers-for-mac-3dmc",
          "publishedOn": "2021-06-23T05:56:59.000Z",
          "wordCount": 877,
          "title": "Top 5 Password managers for Mac"
        },
        {
          "id": "https://dev.to/hirendhaduk_/top-6-security-best-practices-for-angular-apps-8n1",
          "author": "Hiren Dhaduk",
          "description": "It's common to be concerned about security vulnerabilities in frontend frameworks. While Angular is the most preferred frontend framework among the developers for developing single-page applications, there are still security threats that need due attention for protecting Angular apps. \nKeep these top 5 security best practices at hand when building Angular apps. \nTo prevent the injection of scripts into DOM elements such as authentication details, social security numbers, web tokens, etc. \nTo prevent these malfunctions, use the InnerHTML property to sanitizes all the data that shows in components. But one should bind it to use to keep Angular alert enough to sanitize malicious activity-related strings. This interprets data as HTML in its context and is sanitized. It sanitizes the server-sid…",
          "link": "https://dev.to/hirendhaduk_/top-6-security-best-practices-for-angular-apps-8n1",
          "publishedOn": "2021-06-23T04:28:26.000Z",
          "wordCount": 906,
          "title": "Top 6 security best practices for Angular apps"
        },
        {
          "id": "https://dev.to/leh_mariaa/introducao-ao-conceito-de-autenticacao-33p6",
          "author": "Leh 🚘",
          "description": "Qualquer pessoa que utilize algum serviço da internet hoje, \nAutenticação faz parte de um processo de segurança. No caso de uma aplicação, o famoso \"login\" é uma forma de autenticação.\nExistem inúmeras maneiras de um usuário realizar o login em alguma aplicação, mas aqui o foco é introduzir como funciona a autenticação de maneira bem breve e entender alguns conceitos de segurança da informação.\nEntendendo o IAAA\n\n\nEntrando mais no quesito fundamental de segurança, a sigla IAAA vem de identification, authentication, authorization e accounting, que em português significa identificação, autenticação, autorização e auditoria. \nTer em mente esses 4 conceitos é bem importante para entender o processo de autenticação.\nIdentificação - Algo que mostre quem você é\n\n\nAutenticação - Algo que prova que…",
          "link": "https://dev.to/leh_mariaa/introducao-ao-conceito-de-autenticacao-33p6",
          "publishedOn": "2021-06-23T03:04:36.000Z",
          "wordCount": 1610,
          "title": "Introdução ao conceito de autenticação"
        },
        {
          "id": "https://dev.to/boney/lumino-secure-multi-party-computation-ceremony-4m43",
          "author": "Boney",
          "description": "The PlatON Secure Multiparty Computing Ceremony Lumino is launched! The 60-day ceremony invites cryptography and blockchain geeks around the world to get deeply involved in building a privacy computing infrastructure!\nThe open source code and software can be downloaded at： https://github.com/PlatONnetwork/Lumino\nLumino ceremony homepage: \nhttps://lumino.latticex.foundation/home\nSend an email to LatticeX Foundation at lumino@latticex.foundation In the email, please fill in the following information:\nName (first name or nickname)\nAlaya Network Address\nCorrespondence address (mailing address for gifts)\nWhich computing group you would like to join (BN254 curve group or BLS12–381 curve group, or both.)\nWhether you would like to apply for the Google Cloud.\nQ&A | All about Lumino, the secure multi-party computation ceremony\nWelcome to Join Lumino\nWelcome developers to PlatON\ndeveloper@latticex.foundation to submit more ideas and suggestions",
          "link": "https://dev.to/boney/lumino-secure-multi-party-computation-ceremony-4m43",
          "publishedOn": "2021-06-23T02:49:29.000Z",
          "wordCount": 493,
          "title": "Lumino - Secure Multi-Party Computation Ceremony"
        },
        {
          "id": "https://dev.to/robertinoc_dev/how-to-use-psychology-to-increase-mfa-adoption-pdp",
          "author": "Robertino",
          "description": "🧠 Common cognitive biases may be impacting your MFA adoption rates; here are some ways to counter those impacts.\n\n\n\n  \n  \n  \nMulti-factor Authentication (MFA) has been shown capable of blocking up to 99.9% of brute force attacks. Yet a recent IBM/Ponemon Institute study found that only 36% of responding organizations require it. And adoption numbers for the general public aren’t encouraging either, with a report from LastPass finding that only 37% of respondents use MFA for their work accounts. When you add the finding by Verizon that 80% of data breaches involves the use of stolen credentials, these numbers beg the question, why?\nIf MFA has been proven so effective as a defense against data theft and brute force attacks, why are adoption numbers still so low? A common set of issues revol…",
          "link": "https://dev.to/robertinoc_dev/how-to-use-psychology-to-increase-mfa-adoption-pdp",
          "publishedOn": "2021-06-22T17:29:17.000Z",
          "wordCount": 802,
          "title": "👤 How to Use Psychology to Increase MFA Adoption"
        },
        {
          "id": "https://dev.to/aws-builders/aws-security-hub-3ig8",
          "author": "pablosalas81",
          "description": "What is AWS Security Hub?\nBenefits of AWS Security Hub:\nSecurity Hub reduces the effort to collect and prioritize security findings across accounts from integrated AWS services and AWS partner products.\n\nSecurity Hub processes finding data using a standard finding format, which eliminates the need to manage findings data from multiple formats.\n\nSecurity Hub then correlates findings across providers to prioritize the most important ones.\n\nAutomatic security checks against best practices and standards\nSecurity Hub automatically runs continuous, account-level configuration and security checks based on AWS best practices and industry standards.\n\nSecurity Hub provides the result of these checks as a readiness score, and identifies specific accounts and resources that require attention.\n\nConsoli…",
          "link": "https://dev.to/aws-builders/aws-security-hub-3ig8",
          "publishedOn": "2021-06-22T12:14:45.000Z",
          "wordCount": 835,
          "title": "AWS Security Hub"
        },
        {
          "id": "https://dev.to/fluree/tutorial-to-do-list-generator-v2-identity-and-permissions-n3k",
          "author": "Flor Marshall",
          "description": "Issuing Identity and Permissions at the Data layer with Fluree DB\n\n\n\n  \n  \n  Recap\n\n\nThis tutorial is a follow up to the first tutorial found here on dev.to or on github on the to-do-list branch, where we built a to-do list generator using React and Fluree. If you are not familiar with Fluree, please refer to the first part of this tutorial series to learn the basics.\nTo get started git clone the repo via git clone https://github.com/fluree/version-2-lists-generator.git, or any other preferred method.\n\n\ncd into the repo and run npm install\n\n\nthen run npm start to locally serve the app in your browser at http://localhost:3000\n\n\n\n\n  \n  \n  Fluree\n\n\nAs previously mentioned Fluree is a Web3-capable graph database platform powered by an immutable ledger. The architecture of Fluree gives develope…",
          "link": "https://dev.to/fluree/tutorial-to-do-list-generator-v2-identity-and-permissions-n3k",
          "publishedOn": "2021-06-21T18:06:30.000Z",
          "wordCount": 2945,
          "title": "Tutorial: To-Do List Generator V2: Identity and Permissions"
        },
        {
          "id": "https://dev.to/robertinoc_dev/the-future-of-crypto-5jo",
          "author": "Robertino",
          "description": "☑️ Permission.io’s CTO Hunter Jensen on crypto regulation, advice for the crypto-curious, and blockchain.\n\n\n\n  \n  \n  \nEDITOR’S NOTE: Crypto (digital currency) is becoming more mainstream with crypto exchange Coinbase’s IPO splash and the creation of the cyber yuan. Permission.io’s business model uses Auth0 to protect its platform while delivering digital currency in exchange for permission-based advertising. We invited their CTO, Hunter Jensen, to pen a post to share his thoughts on crypto’s future.\nToday crypto is highly volatile — investing can be a real roller coaster. But that’s changing. We just saw the first public valuation of a cryptocurrency company, with Coinbase coming in at $86 billion. Governments are creating digital currency or at least talking about it. Here’s why I think e…",
          "link": "https://dev.to/robertinoc_dev/the-future-of-crypto-5jo",
          "publishedOn": "2021-06-21T14:37:04.000Z",
          "wordCount": 739,
          "title": "💰 The Future of Crypto"
        },
        {
          "id": "https://dev.to/mackenziejj/codecov-supply-chain-attack-step-by-step-breakdown-4a2e",
          "author": "mackenziejj",
          "description": "Codecov recently had a significant breach as attackers were able to put a backdoor into Codecov to get access to customers' sensitive data. This article reviews exactly what happened, how attackers gained access, how they used sensitive information and of course, what to do if you were affected. \nThis breach was done by very sophisticated attackers who exploited a mistake in how Codecov built docker images. They used this to modify a script which allowed them to send the environment variables from the CI of Codecov customers to a remote server. While the attackers could have conducted multiple attacks from there, we can see based on other disclosures that one path they did take was accessing private git repositories from the git credentials in the CI environment, then exploiting secrets an…",
          "link": "https://dev.to/mackenziejj/codecov-supply-chain-attack-step-by-step-breakdown-4a2e",
          "publishedOn": "2021-06-21T14:06:23.000Z",
          "wordCount": 2115,
          "title": "Codecov supply chain attack - Step by step breakdown"
        }
      ]
    },
    {
      "title": "DEV Community",
      "feedUrl": "https://dev.to/feed/tag/devops",
      "siteUrl": "https://dev.to",
      "articles": [
        {
          "id": "https://dev.to/lucassha/rolling-back-your-terraform-remote-state-in-s3-2c3n",
          "author": "Shannon",
          "description": "While I hope this is a rare occurrence, I've run into this a few times where I had to rollback Terraform state to a previous version in AWS S3. Why not just keep it in the newer version? Well, some of our CI/CD pipelines used an older version of Terraform (say 0.12), and while none of the resource states actually changed, our code would no longer run after a developer ran something locally on their computer with a newer version of Terraform (say 0.14). \nSo! Here's a simple example on how to rollback state. \nNote: you must have versioning enabled on the S3 bucket. If it isn't, PLEASE do that for all places that Terraform State is stored :p\nI'm going to set up this up completely fresh with a new remote state object in S3 with the following Terraform code:\nterraform {\n  backend \"s3\" {\n    buc…",
          "link": "https://dev.to/lucassha/rolling-back-your-terraform-remote-state-in-s3-2c3n",
          "publishedOn": "2021-06-23T22:34:46.000Z",
          "wordCount": 796,
          "title": "Rolling back your Terraform Remote State in S3"
        },
        {
          "id": "https://dev.to/kubecost/how-to-monitor-kubernetes-costs-with-kubecost-and-the-lens-ide-31j2",
          "author": "Stefano Maffulli",
          "description": "Lens is the most powerful IDE for those who need to deal with Kubernetes clusters on a daily basis. It allows you to manage your cluster and view important health metrics. A Kubecost and Lens integration allows you to also visualize Kubernetes costs directly in the Lens UI. With Lens and Kubecost you can view costs and spend efficiency by namespace, pod, deployment and more!\nFor most teams, it’s really difficult to understand the cost of Kubernetes workloads, even in a somewhat static multi-tenant environment. When concepts like autoscaling are introduced, it becomes far more complex. This creates many challenges, including unintentional overspending, poor visibility for business planning, and missing costly bugs/mistakes. Despite the fact that over 32% of respondents to the 2021 FinOps su…",
          "link": "https://dev.to/kubecost/how-to-monitor-kubernetes-costs-with-kubecost-and-the-lens-ide-31j2",
          "publishedOn": "2021-06-23T18:12:04.000Z",
          "wordCount": 883,
          "title": "How to monitor Kubernetes costs with Kubecost and the Lens IDE"
        },
        {
          "id": "https://dev.to/opsera/why-we-need-tool-choice-a-developer-s-story-4m8n",
          "author": "Opsera_Staff",
          "description": "By Susmitha Vakkalanka\nAs I landed my first real job as a developer, Britney Spears had the song of the summer, Y2K bugs were about to throw the world into the dark ages, and everyone on my new team used the same tools to code, test, and deploy. As a fresh-out-of-college noob, I was thrown onto tools with steep learning curves resulting in low productivity rates. I thought it was the way it worked and I had to pay my dues to get comfortable with the system. \nI have since come to understand that there are better processes. In the words of Britney, Oh baby, baby, how was I supposed to know that something wasn't right here?\nThose were simpler times and twenty years later, we’ve seen an explosion of environments your code is deployed into accompanied by an explosion of tools to support those e…",
          "link": "https://dev.to/opsera/why-we-need-tool-choice-a-developer-s-story-4m8n",
          "publishedOn": "2021-06-23T16:50:14.000Z",
          "wordCount": 1334,
          "title": "Why We Need Tool Choice - A Developer’s Story"
        },
        {
          "id": "https://dev.to/rthefounding/using-the-map-method-to-extract-data-from-an-array-h5k",
          "author": "Randy Rivera",
          "description": "Let's start with some simple array functions, which are methods on the array object prototype. In this post we are looking at Array.prototype.map(), or more simply map.\n\n\nThe map method iterates over each item in an array and returns a new array containing the results of calling the callback function on each element. It does this without mutating the original array.\n\n\nWhen the callback is used, it is passed three arguments. The first argument is the current element being processed. The second is the index of that element and the third is the array upon which the map method was called.\n\n\nBelow is an example using the map method on the users array to return a new array containing only the names of the users as elements. For simplicity, the example only uses the first argument of the callback…",
          "link": "https://dev.to/rthefounding/using-the-map-method-to-extract-data-from-an-array-h5k",
          "publishedOn": "2021-06-23T16:27:29.000Z",
          "wordCount": 1239,
          "title": "Using the map Method to Extract Data from an Array"
        },
        {
          "id": "https://dev.to/grapecity/create-excel-files-with-excel-2016-features-in-c-net-part-one-375e",
          "author": "Lauren Del Signore",
          "description": "This blog is Part One of a multi-part series that highlights the Excel 2016 functions and shows how to create an Air Quality Index report (AQI) using GcExcel API.\nWith the abundance of data available to businesses today, it becomes even more important to find efficient ways to analyze and process this data in meaningful ways.  Spreadsheets are a powerful way to manage this. Specifically, by using functions, complex calculations can be created to save time, money and ultimately provide a robust analysis of large data sets. \nWith the MSExcel 2016 release, six new functions are introduced, simplifying some common calculations:  \n The CONCAT function can be used to combine multiple string values, including values in cell ranges. \n The TEXTJOIN function can also be used to combine multiple stri…",
          "link": "https://dev.to/grapecity/create-excel-files-with-excel-2016-features-in-c-net-part-one-375e",
          "publishedOn": "2021-06-23T15:35:46.000Z",
          "wordCount": 2585,
          "title": "Create Excel Files With Excel 2016 Features in C# .NET Part One"
        },
        {
          "id": "https://dev.to/ramushetty/aws-creating-an-ec2-instance-29fl",
          "author": "Ramu Ummadishetty",
          "description": "EC2 stands for Amazon Elastic Compute cloud.Simple way you will get a VM in the cloud just like your PC.\nNow will see how to configure EC2 in AWS\nStep1\n\nstep2 \n\nsetp3\n\nstep4\nstep5\n\nstep6\n\nstep7\n\nstep8\n\nstep9\n\nAgain click on service , EC2 and click on running instances\n\nselect  and click on connect on top\n\nYou will find ssh client and ssh cmd\n\nuse that in your git bash or terminal to connect to server\nNote: Please select free instance if you are new to AWS",
          "link": "https://dev.to/ramushetty/aws-creating-an-ec2-instance-29fl",
          "publishedOn": "2021-06-23T15:20:30.000Z",
          "wordCount": 629,
          "title": "AWS Creating an EC2 Instance"
        },
        {
          "id": "https://dev.to/aws-builders/introduction-to-claudia-js-4cap",
          "author": "Salah Elhossiny",
          "description": "What is Claudia.js?\n\n\nClaudia.js is a tool designed to simplify deployment of Node.js projects to AWS Lambda and API Gateway. It automates deployment tasks so you don’t need to worry about introducing errors and configures everything the way you would expect it to be set up out of the box.\nAccording to the official website, Claudia’s primary objective is to help JavaScript developers get started using Lambda microservices easily so they can “focus on solving important business problems instead of dealing with AWS deployment workflows.”\nIn this section, we’ll walk you through setting up an example Node.js and Express.js app to show Claudia.js in action.\nClaudia.js is available on npm. The simplest way to use Claudia.js is to install it as a global utility:\n\nnpm install -g claudia\n\n\nInstall the Express.js app generator using npm:\n\nnpm install express-generator -g\n\nexpress claudia-demo\n\ncd claudia-demo\n\nnpm i\n\n\nThe Express.js app will be hosted by a Lambda function, so it needs a handler to send data between the app and the API Gateway. This is where Claudia.js comes in. Claudia uses aws-serverless-express to generate a helper function to interface between API Gateway requests and Express.js requests and responses.\nExecute the command below in your project directory. If you have renamed your Express.js application module, replace app with the name of the main Express.js application module:\n$ claudia generate-serverless-express-proxy --express-module\napp\n\nYour app is now ready to go live:\n\nclaudia create --handler lambda.handler \\ \n   --deploy-proxy-api \\ \n   --region us-east-1 \n\n\n Claudia",
          "link": "https://dev.to/aws-builders/introduction-to-claudia-js-4cap",
          "publishedOn": "2021-06-23T14:34:18.000Z",
          "wordCount": 668,
          "title": "Introduction to Claudia.js"
        },
        {
          "id": "https://dev.to/ankit01oss/bash-cheat-sheet-top-28-commands-for-you-to-learn-15ee",
          "author": "Ankit Anand ✨",
          "description": "Hi there,\nToday I want to bring you a summary of top Bash commands. Bash is a very popular shell program. It stands for 'Bourne Again Shell'. There are also other types of shells, but Bash is the most widely available and used shell.\nAnything inside [ ] means that it's optional.\nls - List directory contents\n\n\nls is one of the most common commands. It is used to list the contents of a directory.\nSyntax: ls [options][files]\n\nls -a shows hidden(dot) files\nls -l shows file details\necho - Prints text to the terminal window\n\n\necho prints text to the terminal window. It is used widely for printing status texts and values of environment variables.\nbash-3.2$ echo \"hello\"\nhello\n\ntouch - Creates a file\n\n\ntouch can be used to create an empty file quickly. It can also be used to modify file timestamps.…",
          "link": "https://dev.to/ankit01oss/bash-cheat-sheet-top-28-commands-for-you-to-learn-15ee",
          "publishedOn": "2021-06-23T14:30:15.000Z",
          "wordCount": 1975,
          "title": "Bash cheat sheet: Top 28 commands for you to learn 🤺"
        },
        {
          "id": "https://dev.to/logiq/run-your-favorite-helm-chart-using-microk8s-in-5-minutes-3ii",
          "author": "Ajit Chelat",
          "description": "Helm is a Kubernetes package manager that helps you find, share, and use software built for Kubernetes. With Helm Charts, you can bundle Kubernetes deployments into a single package you can install by running a single command. At LOGIQ, we use Helm Charts on the regular. One of our most commonly used Helm Charts is logiq – the same Helm Chart we use for quick deployments of the LOGIQ observability platform for customers, prospects, and folks who’d love to know more about what we’re building. \nThis article will explain how you can deploy your favorite Helm Chart on MicroK8s in under 5 minutes. \nMicroK8s is a lightweight, pure-upstream Kubernetes aiming to reduce entry barriers for K8s and cloud-native application development. It comes in a single package that installs a single-node (standal…",
          "link": "https://dev.to/logiq/run-your-favorite-helm-chart-using-microk8s-in-5-minutes-3ii",
          "publishedOn": "2021-06-23T13:35:02.000Z",
          "wordCount": 1516,
          "title": "Run your favorite Helm Chart using MicroK8s in 5 minutes"
        },
        {
          "id": "https://dev.to/ishant14/complete-application-deployment-using-kubernetes-1b4b",
          "author": "Ishant Gaurav",
          "description": "In this post, we will be deploying a complete end to end application using Kubernetes. We will see and discuss how the different components of Kubernetes compliment each other and make the application deployment process smooth.\nWe will be using minikube to deploy our application on our local system. You can refer this link to read more about minikube : https://minikube.sigs.k8s.io/docs/start/\nOnce you are done with this post, you would be familiar with the below concepts in Kubernetes:\nCreating Deployment using YAML file.\nWhat is Pod and How to define the pod in YAML config file.\nHow to to create internal service and make the pod accessible to other component in the cluster.\nHow to create external service and make the pod accessible outside the cluster.\nSample application which we will be …",
          "link": "https://dev.to/ishant14/complete-application-deployment-using-kubernetes-1b4b",
          "publishedOn": "2021-06-23T05:11:24.000Z",
          "wordCount": 2175,
          "title": "Complete Application Deployment using Kubernetes"
        },
        {
          "id": "https://dev.to/dsvdeveloper88/best-javascript-frameworks-for-mobile-app-development-5ag6",
          "author": "Chris Fowler",
          "description": "jQuery Mobile, Reach Native, NativeScript, Apache Cordova, Ionic, and Titanium are all JavaScript Frameworks that are advantageous for app development. In this article. Let’s take a look to explore the most popular JavaScript frameworks more detail.\n\nPerhaps the biggest advantage of building apps using jQuery Mobile is the speed at which the applications load. jQuery eliminates the need for device-specific languages, so developers can use standards such as JavaScript, HTML5, and CSS3.\nAs a lightweight framework, it’s based on the jQuery library and has a strong focus on compatibility, so it can be used for Android, Windows, Blackberry, and iOS apps.\nReact Native has the edge over other frameworks due to its declarative programming style and reusable components for user interfaces. In addit…",
          "link": "https://dev.to/dsvdeveloper88/best-javascript-frameworks-for-mobile-app-development-5ag6",
          "publishedOn": "2021-06-23T03:32:22.000Z",
          "wordCount": 805,
          "title": "Best JavaScript Frameworks for Mobile App Development"
        },
        {
          "id": "https://dev.to/ridvanaltun/deploy-a-multi-node-kubernetes-cluster-with-vagrant-5bc9",
          "author": "Ridvan Altun",
          "description": "Deploying a Kubernetes cluster is a time consuming and boring job so I created a project for solving this issue.\nHere is the project: https://github.com/ridvanaltun/kubernetes-vagrant\nJust follow the below steps:\n# Install the plugin for Vagrant to ability to use environment files.\n$ vagrant plugin install vagrant-env\n\n# Clone the project.\n$ git clone https://github.com/ridvanaltun/kubernetes-vagrant.git \n\n# Go into it.\n$ cd kubernetes-vagrant\n\n# Don't forget to customize your own environment file.\n$ cp .env.example .env\n\n# Up one master and two worker node.\n# This takes approximately ~15 minutes if you using first time.\n$ vagrant up m n1 n2\n\n# Connect to master node over SSH.\n$ vagrant ssh m\n\n# You can do everything you want, an example, list nodes.\n$ kubectl get nodes\n\nIt is simple like that.",
          "link": "https://dev.to/ridvanaltun/deploy-a-multi-node-kubernetes-cluster-with-vagrant-5bc9",
          "publishedOn": "2021-06-22T23:35:40.000Z",
          "wordCount": 499,
          "title": "Deploy a Multi-Node Kubernetes Cluster with Vagrant"
        }
      ]
    },
    {
      "title": "DEV Community",
      "feedUrl": "https://dev.to/feed/tag/linux",
      "siteUrl": "https://dev.to",
      "articles": [
        {
          "id": "https://dev.to/alexandreliberato/instalando-asdf-no-ubuntu-20-04-17gl",
          "author": "Alexandre Liberato",
          "description": "Sobre\n\n\nEstava tentando testar essa ferramenta para gerenciamento de linguagens e ferramentas, segue o caminho que trilhei da instalação até ter o executável da linguagem que desejava, golang no caso, disponível na linha de comando:\n# sudo apt install curl git\n$ git clone https://github.com/asdf-vm/asdf.git ~/.asdf --branch v0.8.1\n\nAbra o arquivo ~/.bashrc e adicione as seguintes linhas:\n#\n# asdf - language/tools version manager\n#\nsource ~/.asdf/asdf.sh\nsource ~/.asdf/completions/asdf.bash\n\nExecute:\n$ . .bashrc\nPronto, basta testar:\n$ asdf info\nPara instalar a linguagem Go por exemplo, basta:\n$ asdf install golang 1.16.5\n$ asdf global golang 1.16.5\n$ asdf shell golang 1.16.5\n\nE para verificar a instalação:\n$ go version",
          "link": "https://dev.to/alexandreliberato/instalando-asdf-no-ubuntu-20-04-17gl",
          "publishedOn": "2021-06-23T18:00:27.000Z",
          "wordCount": 533,
          "title": "Instalando asdf e Golang no Ubuntu 20.04"
        },
        {
          "id": "https://dev.to/ankit01oss/bash-cheat-sheet-top-28-commands-for-you-to-learn-15ee",
          "author": "Ankit Anand ✨",
          "description": "Hi there,\nToday I want to bring you a summary of top Bash commands. Bash is a very popular shell program. It stands for 'Bourne Again Shell'. There are also other types of shells, but Bash is the most widely available and used shell.\nAnything inside [ ] means that it's optional.\nls - List directory contents\n\n\nls is one of the most common commands. It is used to list the contents of a directory.\nSyntax: ls [options][files]\n\nls -a shows hidden(dot) files\nls -l shows file details\necho - Prints text to the terminal window\n\n\necho prints text to the terminal window. It is used widely for printing status texts and values of environment variables.\nbash-3.2$ echo \"hello\"\nhello\n\ntouch - Creates a file\n\n\ntouch can be used to create an empty file quickly. It can also be used to modify file timestamps.…",
          "link": "https://dev.to/ankit01oss/bash-cheat-sheet-top-28-commands-for-you-to-learn-15ee",
          "publishedOn": "2021-06-23T14:30:15.000Z",
          "wordCount": 1975,
          "title": "Bash cheat sheet: Top 28 commands for you to learn 🤺"
        },
        {
          "id": "https://dev.to/mrdestructive/vim-keymapping-guide-3olb",
          "author": "Meet Gor",
          "description": "Introduction\n\n\nKeymapping or Key binding is a process in which a user or a system can assign certain keys or commands to perform a particular task or commands. This can be quite useful in Vim as well as in other text editors to avoid some repetitive tasks and save time. In Vim this can be a great power to have for programmers as it can be really very flexible to set up for any programming language and it's environment.\nThis is not a in-depth guide of Vim-keymappings, it is just a overview of how to make keymappings and make the workflow a bit easier, probably give some insights on the strength of Vim to easily integrate with terminal and perform tasks with shortcuts. \nIn Vim, you can map a particular keystroke combination to trigger a command or any operation. You can also map a key in pla…",
          "link": "https://dev.to/mrdestructive/vim-keymapping-guide-3olb",
          "publishedOn": "2021-06-23T10:06:05.000Z",
          "wordCount": 2143,
          "title": "Vim : Keymapping Guide"
        },
        {
          "id": "https://dev.to/aws-builders/backup-your-file-server-or-any-data-using-hybrid-cloud-storage-gateway-solution-aws-1pn0",
          "author": "Filipe Motta",
          "description": "Introduction\n\n\nYou can use cloud storage for on-premises data backups to reduce infrastructure and administration costs. There is several ways to backup your on-premise infrastructure to cloud, here I’ll use hybrid cloud (part of your infrastructure is on the cloud and part of your infrastructure is on the on-premise) to accomplish it. In this post I’ll show AWS Storage Gateway solutions to bridge between on-premise data to cloud. The common use case is disaster recovery, backup & restore and tiered storage.\nThere is 3 types of Storage Gateway:\n\nBefore show how I implemented it, I’ll show a brief overview about each one.\nDatabases and applications are often backed up directly to a file server on-premises. You can now simply point these backups to the File Gateway, which copies the data to …",
          "link": "https://dev.to/aws-builders/backup-your-file-server-or-any-data-using-hybrid-cloud-storage-gateway-solution-aws-1pn0",
          "publishedOn": "2021-06-22T17:23:11.000Z",
          "wordCount": 2955,
          "title": "Backup your file server or any data using Hybrid Cloud - Storage Gateway Solution (AWS)"
        },
        {
          "id": "https://dev.to/ubuntu/basic-commands-in-ubuntu-part1-2ch1",
          "author": "Amoo ubuntu:)",
          "description": "Hi! Today we are going to know about some useful commands. In this part we will learn important commands about system info and if you enjoy i will publish second part. :)\nLinux has many commands some of them are very useful and some of them are dangerous don't try to run all commands on your terminal. I will publish another article about dangerous commands in linux. I hope you enjoy this if it is helpful share with your friends :).",
          "link": "https://dev.to/ubuntu/basic-commands-in-ubuntu-part1-2ch1",
          "publishedOn": "2021-06-22T16:14:35.000Z",
          "wordCount": 584,
          "title": "BASIC COMMANDS IN UBUNTU  (PART1)"
        },
        {
          "id": "https://dev.to/mirhsquadri/blockchain-is-a-natural-evolution-of-open-source-thoughts-3ch0",
          "author": "mirhsquadri",
          "description": "I am writing an article for a magazine on how blockchain is a natural evolution of open source. Now I know that open source is conceptual whereas blockchain is an actual technology. But I was wondering if blockchain could be considered a new form of open source implementation of systems given that they both find their roots in the same principles of decentralisation and transparency. Would love to get thoughts of fellow developers on this.",
          "link": "https://dev.to/mirhsquadri/blockchain-is-a-natural-evolution-of-open-source-thoughts-3ch0",
          "publishedOn": "2021-06-22T15:16:07.000Z",
          "wordCount": 1005,
          "title": "\"Blockchain is a natural evolution of open source\". Thoughts?"
        },
        {
          "id": "https://dev.to/waqar/replace-ftp-with-the-scp-command-in-the-terminal-4kk2",
          "author": "Waqar Ahmed",
          "description": "SCP comes in handy to copy files to a remote server from a computer or vice versa. You can also copy server files to another server.\nAll you need is your server’s IP address and user credentials to start copying. Here are some common SCP commands use cases.\nscp file.zip user@hostip:/home/directory\n\nThis command will copy file.zip in your terminals present working directory to the home directory of the server.\nscp user@hostip:/home/directory/file.zip ~/Downloads\n\nYou are copying file.zip from the server’s home directory to your local downloads folder.\nAnother use case of the SCP command is during site migration to a new server. Zip your site’s root directory and copy it to the new server.\nProvide login credentials and file paths of both servers to SCP in your computer’s terminal.\nscp user@remotehost1:/home/file.zip user@remotehost2:/home\n\nAdd -p flag to add port of remote host\nscp -p 1122 file.zip user@hostip:/home/directory\n\nAdd a -C flag to enable the gzip compression in SSH transfer\nscp -C localfile.zip user@hostip:/home/directory\n\n-v Verbose SCP operation\n-p <port> Mention remote host port\n-P Save the file’s modification and access times\n-r Copy recursively\n-c <cipher> Specify the cipher for data encryption\nSo if you are still using an FTP client, use the SCP command in the terminal for a secure transfer.",
          "link": "https://dev.to/waqar/replace-ftp-with-the-scp-command-in-the-terminal-4kk2",
          "publishedOn": "2021-06-22T14:45:47.000Z",
          "wordCount": 662,
          "title": "Replace FTP with the SCP command in the terminal"
        },
        {
          "id": "https://dev.to/saluki/4-tools-all-developers-should-use-212g",
          "author": "Seth",
          "description": "Developers are always looking for simpler ways to do more advanced things in less time, and one of the many ways that they can achieve this is by using a selection of tools to supplement their workflow. The aim of this article is to cover some of the major tools that people use, and to give you an insight into what they can do to make your life easier.\nAnd to seal the deal, all the tools I’ll be mentioning are completely free to use, which is an incredible price for what you’re getting from them.\nGit / Version Control\nGit is the most well-known version control tool out there. It allows you to store your code on a server (thereby reducing data-loss risks), collaborate with other developers and share your code online. Another huge plus to Git is that it allows you to go and look at other people’s public repositories, and see how they solved certain problems. This can then help you solve the problem in your application, and it can save you lots of time and effort.\nGit is open-source itself and it comes with a huge selection of extensions that allow you to modify the functionality of the system in a huge range of different ways.\nThe fact that Git allows you to go back and review previous versions of your code, see how it’s changed and keep track of issues as well as provide you with lots of automation tools makes it quite clear that Git, or a Git alternative is a must-have for nearly every project.\nWhilst you could install a system like Gitea on a VPS and then run your own Git server, there is a selection of different services out there that provide Git repository hosting as a service. These services often come with lots of extras too, and usually a very generous free tier. The most notable Git host out there is definitely GitHub, but it is closely rivalled by GitLab among other solutions.\nWant to read more? You can find the full article on my blog: https://www.saluki.tech/2021/06/18/4-tools-all-developers-should-use/",
          "link": "https://dev.to/saluki/4-tools-all-developers-should-use-212g",
          "publishedOn": "2021-06-22T13:53:47.000Z",
          "wordCount": 721,
          "title": "4 tools all developers should use"
        },
        {
          "id": "https://dev.to/kagundajm/installing-ms-sql-server-2019-on-parrot-os-4h3b",
          "author": "Kagunda JM",
          "description": "Introduction\n\n\nParrot OS is a light Linux distribution based on Debian. Microsoft SQL Server or SQL Server is a relational database management system (RDBMS) developed by Microsoft. Starting with SQL Server 2017, Microsoft added Linux support and thus making any newer versions cross platform.\nThis post steps through the process of SQL Server 2019 Developer edition installation on Parrot OS and contains the following topics:\ndownloading and configuring MS SQL Server 2019 package repository\nrunning the SQL Server setup process\ninstallation of SQL Server command line tools\ninstallation Azure Data Studio\nrunning queries in Azure Data Studio\nThe commands used in this post will also work on any Debian based distribution like Ubuntu, MX Linux, Linux Mint, Knoppix among many others.\nParrot OS has …",
          "link": "https://dev.to/kagundajm/installing-ms-sql-server-2019-on-parrot-os-4h3b",
          "publishedOn": "2021-06-22T11:13:55.000Z",
          "wordCount": 1493,
          "title": "Installing MS SQL Server 2019 on Parrot OS"
        },
        {
          "id": "https://dev.to/intrigueit/five-5-important-key-tips-to-improve-your-data-security-3hbd",
          "author": "Khan Nazibullah",
          "description": "Digitization has revolutionized the way we work. Critical business applications and data are just a keystroke away, no matter where the employee is or what time. Perhaps it is this familiarity with data that makes employees feel so connected to it when they change jobs. Even they often take some of it with them. Perhaps that is why most of them do not consider this a criminal act.\nWhatever the reasons for this deliberate filtering of data; lack of security can affect the growth of an organization and its ability to maintain a competitive advantage. But with greater visibility into internal threats, organizations can expel bad players and improve overall security.\nBelow are 5 (five) major events that organizations are monitoring cloud applications and how their attention can help ensure good environment in the company.",
          "link": "https://dev.to/intrigueit/five-5-important-key-tips-to-improve-your-data-security-3hbd",
          "publishedOn": "2021-06-21T10:35:45.000Z",
          "wordCount": 529,
          "title": "Five (5) Important Key Tips to Improve Your Data Security"
        },
        {
          "id": "https://dev.to/ashutoshpatole/change-directory-command-47ld",
          "author": "Ashutosh Patole",
          "description": "This is my first blog on this platform. 😁\nWe might face the situation where we have to navigate the file system through a terminal or cmd because of lack of GUI  feature in the system like Servers. So it is must to know the basics of cd command.\ncd command means Change Directory which is kind of self explanatory term. Now before jumping into the examples there is something we should know i.e, Paths in file system.\nThere are two types of paths in any operating system. \nAbsolute Path\nRelative Path\nAbsolute path is nothing but a path given from the root of the file system.\n/home/user/Desktop/someDirectory\n\nThis is an example of absolute path because we have to provide the path from the bottom most part of the file system heirarchy.\nIn Relative path we don't have to give whole location of the…",
          "link": "https://dev.to/ashutoshpatole/change-directory-command-47ld",
          "publishedOn": "2021-06-21T04:41:49.000Z",
          "wordCount": 1463,
          "title": "change directory command"
        },
        {
          "id": "https://dev.to/myterminal/why-and-how-i-migrated-my-thinkpad-from-arch-to-debian-27cm",
          "author": "Mohammed Ismail Ansari",
          "description": "This article outlines my migration from Arch Linux to Debian. The details about the migration are spanned across a few videos, but below is a reasonably short summary.\nI moved back from macOS to Linux and I'm loving it!\nMohammed Ismail Ansari ・ Mar 18 ・ 2 min read\n#linux\n        #macos\n        #setup\n      \nArch gave me a fresh new direction to explore and experience Linux the way I never did before. I created a couple of reusable artifacts and it in a way became a base for my second YouTube channel.\nThings kept breaking, and I found myself spending more time on fixing things than I expected, even with my prior experience with Linux before I spent four years on macOS.\n\n\n\n\nSo I started looking out for alternatives and found the exact thing I was looking for.\nI couldn't lose the control I had over my Linux setup back with Arch by delegating it to a graphical installer. So I installed Debian in the way we usually do install Arch.\n\n\n\n\nAll this learning had to be documented somewhere so I created another video talking about the process in a little bit of detail.\nMoving to Debian meant re-setting up the entire machine, even deeper than what I had to do back when I moved the factory-installed Windows to a smaller partition to make space for my primary Linux partition.\n\n\n\n\nThe new setup took away a few issues I never got fixed, and in exchange, brought with it a few other ones. I talked about the similarities, differences, negatives, and most importantly, the positives of the migration in a separate video, adding another episode to my series Back to Linux.\nAs I did last time, I'll keep my eyes open for ways to improve my setup and workflow, and will keep documenting my learning to be able to share them with the rest of the community.\nNeedless to say, I'm loving the alternate universe with Debian. Do throw in your ideas and thoughts in the comments and hopefully, we can learn something from each other.",
          "link": "https://dev.to/myterminal/why-and-how-i-migrated-my-thinkpad-from-arch-to-debian-27cm",
          "publishedOn": "2021-06-20T20:59:09.000Z",
          "wordCount": 808,
          "title": "Why and How I migrated my ThinkPad from Arch to Debian"
        }
      ]
    },
    {
      "title": "DEV Community",
      "feedUrl": "https://dev.to/feed/tag/angular",
      "siteUrl": "https://dev.to",
      "articles": [
        {
          "id": "https://dev.to/joseat/the-truth-about-angular-form-2ji7",
          "author": "Jose Álvarez",
          "description": "introdution\n\n\nIn this article i want to explain how to use angular forms directives in the right way, because i've observed that is not already clear how to use it correctly or what is the diferent about use template forms and built our owned form whith FormBuilder class. I am not going to enter in how to create a form in angular only i want to explain the interesting things.\nI'm going to start with something very simple but could be doubs about this. \nThe question is:  What happens when we use <form #f=\"ngForm\" ... ?\nSomeone could think that we're referencing our form, this could be true, but in reality more things are happening behind the scenes.\nThe truth about this is that when we import FormsModule automatically NgForm is avalilable in our view, this means that NgForm is automatically…",
          "link": "https://dev.to/joseat/the-truth-about-angular-form-2ji7",
          "publishedOn": "2021-06-23T17:06:58.000Z",
          "wordCount": 765,
          "title": "The truth about Angular form"
        },
        {
          "id": "https://dev.to/this-is-angular/implementing-custom-confirmation-modal-for-candeactivate-2fan",
          "author": "Nikhil Dhawan",
          "description": "Hi all, in this article, we will discuss what canDeactivate means and how to have a custom confirmation modal implemented based on our app theme.\nIn Angular we get in build support for the routes we define to have implementation for canDeactivate guard which is how we can restrict the user from moving away from the view when some work is in progress on the current view. Example User is making an edit on his profile page and didn't click on the save button so at that time if we have implemented the router guard for canDeactivate, the user will be asked for the confirmation.\ncanDeactivate(\n    component: Component,\n    currentRoute: ActivatedRouteSnapshot,\n    currentState: RouterStateSnapshot,\n    nextState?: RouterStateSnapshot): Observable<boolean | UrlTree> | Promise<boolean | UrlTree> |…",
          "link": "https://dev.to/this-is-angular/implementing-custom-confirmation-modal-for-candeactivate-2fan",
          "publishedOn": "2021-06-23T08:34:31.000Z",
          "wordCount": 998,
          "title": "Implementing custom confirmation modal for canDeactivate"
        },
        {
          "id": "https://dev.to/kreuzerk/angular-structural-directives-how-to-implement-your-own-ngif-367h",
          "author": "kreuzerk",
          "description": "Watch on Youtube »",
          "link": "https://dev.to/kreuzerk/angular-structural-directives-how-to-implement-your-own-ngif-367h",
          "publishedOn": "2021-06-23T06:40:16.000Z",
          "wordCount": 439,
          "title": "Angular structural directives - how to implement your own ngIf"
        },
        {
          "id": "https://dev.to/hirendhaduk_/top-6-security-best-practices-for-angular-apps-8n1",
          "author": "Hiren Dhaduk",
          "description": "It's common to be concerned about security vulnerabilities in frontend frameworks. While Angular is the most preferred frontend framework among the developers for developing single-page applications, there are still security threats that need due attention for protecting Angular apps. \nKeep these top 5 security best practices at hand when building Angular apps. \nTo prevent the injection of scripts into DOM elements such as authentication details, social security numbers, web tokens, etc. \nTo prevent these malfunctions, use the InnerHTML property to sanitizes all the data that shows in components. But one should bind it to use to keep Angular alert enough to sanitize malicious activity-related strings. This interprets data as HTML in its context and is sanitized. It sanitizes the server-sid…",
          "link": "https://dev.to/hirendhaduk_/top-6-security-best-practices-for-angular-apps-8n1",
          "publishedOn": "2021-06-23T04:28:26.000Z",
          "wordCount": 906,
          "title": "Top 6 security best practices for Angular apps"
        },
        {
          "id": "https://dev.to/karvel/creating-a-multi-control-custom-validator-in-angular-if",
          "author": "Elanna Grossman",
          "description": "Custom validators in Angular’s reactive form library are one of the most powerful (and in my opinion overlooked) tools a developer has to create better form UI/UX. Custom validators aren’t just limited to a single control. It is easy to evaluate an entire group. This is great for comparing multiple controls. In this article I create a multi-control custom validator that validates two fields if their values match to show an example of what is possible.\nAs I mentioned in my previous article about custom validators, I like using them to both handle custom logic that the built-in validators don’t, and to be able to create the validation error messages in one spot. This makes custom validators powerful and very reusable.\n\nCreating a multi-control custom validator is very similar to creating a s…",
          "link": "https://dev.to/karvel/creating-a-multi-control-custom-validator-in-angular-if",
          "publishedOn": "2021-06-23T03:56:30.000Z",
          "wordCount": 1346,
          "title": "Creating a Multi-Control Custom Validator in Angular"
        },
        {
          "id": "https://dev.to/codever/view-code-snippets-in-fullscreen-mode-16mf",
          "author": "Adrian Matei",
          "description": "You can now view the code snippets in fullscreen mode if they are too long or some of the lines too wide:\n\nFor the implementation in frontend with Angular I used screenfull.js1, which is a simple wrapper for cross-browser usage of the JavaScript Fullscreen API2.\n👉 See How to display an element in full screen in Angular with screenfull.js for complete details about the implementation\n👉 The whole source code of the project is available on Github\nhttps://github.com/sindresorhus/screenfull.js/ ↩\nhttps://developer.mozilla.org/en-US/docs/Web/API/Fullscreen_API ↩",
          "link": "https://dev.to/codever/view-code-snippets-in-fullscreen-mode-16mf",
          "publishedOn": "2021-06-22T18:40:36.000Z",
          "wordCount": 448,
          "title": "View code snippets in fullscreen mode"
        },
        {
          "id": "https://dev.to/ngconf/supercharge-your-angular-application-using-web-workers-5h9b",
          "author": "ng-conf",
          "description": "Zama Khan Mohammed | ng-conf | May 2019\nUI blocking is a thing of the past!\n\n\nhttps://angularprojects.com\n\n\nIf you are building an application where you do a lot of calculations on UI, such as creating CAD documents, doing heavy geometrical calculations, or heavy data table manipulations, then you might have observed that the UI sometimes becomes laggy or janky.\nThis happens because JavaScript is not the only thing that runs on the main thread, but other things like the painting of pixels, style calculations, and many others also run on it. When we run heavy long-running JavaScript on the browser, occasionally we see that frames are missed, which does not provide a great User Experience.\nWe have heard that Web Workers is one of the promising solutions to such a problem, but we never knew t…",
          "link": "https://dev.to/ngconf/supercharge-your-angular-application-using-web-workers-5h9b",
          "publishedOn": "2021-06-22T18:33:00.000Z",
          "wordCount": 1159,
          "title": "Supercharge your Angular application using Web Workers"
        },
        {
          "id": "https://dev.to/kpiteng/axios-vs-fetch-1eh5",
          "author": "kpiteng",
          "description": "Hello Developers! All we are using either Axios OR fetch to communicate/exchange data with server. Both works perfect as per your requirement. Today we will go in detail and see how they are differ in terms of features they provide.\nAxios — has url in request object\naxios\n  .get(url, {\n    headers: {\n      'Content-Type': 'application/json',\n    },\n    timeout: 1000 * 60,\n  })\n  .then(res => {\n\n  })\n  .catch(err => {\n\n  })\n\nFetch — has no url in request object.\n fetch(url)\n  .then((response) => response.json())\n  .then((json) => {  \n\n  })\n  .catch(() => {\n\n  })\n\nAxios — third-party package that you need to install manually. 85.3k Star in Github — Well managed & rich features library.\nnpm i axios\nFetch — is in-build into most of the browser, no more need of installation.\nAxios — having in-b…",
          "link": "https://dev.to/kpiteng/axios-vs-fetch-1eh5",
          "publishedOn": "2021-06-22T16:48:43.000Z",
          "wordCount": 1284,
          "title": "Axios vs Fetch"
        },
        {
          "id": "https://dev.to/prahatravichandan/getting-login-page-element-after-hard-reload-page-angular-3i3i",
          "author": "prahatravichandan",
          "description": "When i try to hard reload website after login it's getting login page element also after login in angular.",
          "link": "https://dev.to/prahatravichandan/getting-login-page-element-after-hard-reload-page-angular-3i3i",
          "publishedOn": "2021-06-22T05:46:47.000Z",
          "wordCount": 365,
          "title": "Getting login page element after hard reload page ANGULAR"
        },
        {
          "id": "https://dev.to/nha/how-we-test-angular2-19al",
          "author": "Chuck Blaine",
          "description": "Hi, I'm Chuck. This will be my first attempt at trying to contribute back to the community in some way and I'm going to try and do it in the realm of testing. So bear with me 🙂.  I appreciate all feedback and constructive feedback is the most helpful.\nThroughout my career as a developer I have heard a lot of people agree that testing our code is something that we should all be doing. Conversely, I have not worked at many places that actually do it. Additionally, and surprisingly to me, rarely if ever do you see a tutorial show any kind of testing when they're trying to teach something unless they're specifically teaching testing.\nWhile I understand that the focus of the lesson may not be testing, I think that if we really want to see testing adopted more widely across our industry then we…",
          "link": "https://dev.to/nha/how-we-test-angular2-19al",
          "publishedOn": "2021-06-20T16:10:02.000Z",
          "wordCount": 1217,
          "title": "How We Test Angular2+"
        },
        {
          "id": "https://dev.to/valoni01/ng-magical-directives-series-ng-container-2979",
          "author": "Valentine Awe",
          "description": "\"Magic is just science that we do not understand yet\" \nThis article is part of what I call the magical directives series. In this series, we will unravel the mystery behind some interesting Angular directives. Afterwards, we can add this little magic to our tool box. I call them magical directives because they play a very important role in building reusable components across our Angular applications.\nBelow are the directives that we will be looking at in this series.\nng-template\nng-container\nng-content\n*ngTemplateOutlet\nlinks to other articles in this series are below\n\n\n  \n  \n  The ng-container\n\n\nThe ng-container is a grouping element that does not introduce a new element in the DOM when used in our template. This means that it does not interfere with the layout and style of your applicati…",
          "link": "https://dev.to/valoni01/ng-magical-directives-series-ng-container-2979",
          "publishedOn": "2021-06-20T11:56:07.000Z",
          "wordCount": 1117,
          "title": "Ng-magical directives series (ng-container)"
        },
        {
          "id": "https://dev.to/maixuanhan/need-ideas-about-some-sw-application-for-writing-11ee",
          "author": "Han Mai",
          "description": "Hi, I want to write about some technical discussion about system designs, architecture designs, programming techniques and how to deal with troubles in real-world but I've found that it is very difficult to just explain topics via multiple arbitrary and unconnected examples. I've got some topics in my mind but I cannot convey them into words. My writing is not good enough. So I'm thinking of implementing some real product while writing about it at a same time. I can post all the design considerations here and will receive feedbacks which will help me (and maybe other people) a lot.\nThe problem is that I cannot think of any ideas about software/applications that are not only practical but also useful for real-life use cases. Simple case studies are good but I'm afraid of that the readers will lose the interest. So any suggestion would be welcome and appreciate.\nThank you very much.",
          "link": "https://dev.to/maixuanhan/need-ideas-about-some-sw-application-for-writing-11ee",
          "publishedOn": "2021-06-19T16:49:57.000Z",
          "wordCount": 497,
          "title": "Need ideas about some SW/application for writing"
        }
      ]
    },
    {
      "title": "DEV Community",
      "feedUrl": "https://dev.to/feed/tag/typescript",
      "siteUrl": "https://dev.to",
      "articles": [
        {
          "id": "https://dev.to/hellomuthu23/react-and-material-ui-landing-page-template-starter-kit-kanban-taskboard-webapp-544i",
          "author": "Muthu Pandian",
          "description": "Are you looking for a good/responsive React landing/Template to bootstrap your app?. You are in the right place. This article will help you to get your web app up and running quickly. Ideal for any hackathon or innovation project!.\n\nGithub: https://github.com/hellomuthu23/react-material-ui-template\nLive site: https://react-material-ui-template.web.app/\nThe ready-to-go template comes with the most essential tech-stack of React, Typescript, React Router, Material-UI, Lint, Prettier, and Cool Landing Page to bootstrap your web app. The app also has below basic features of creating a Taskboard and managing tasks using Kanban board.\nCreate a new Taskboard\nOpen a Task Board\nAdd Task\nMove Task across the different stage using the drag and drop feature\nDelete Task\nThe Landing page is responsive as well, built using material-ui grids.\n\nThe Template has a home page with Toolbar for main navigation, the main content area for displaying page content, and a footer. It also offers a smooth transition/animation effect while loading the content on the page.\n\nThe Taskboard page displays all the tasks in a kanban style format, task can be moved across to different stages using Drag and Drop feature. Along with this you can Add and Delete tasks. All data is stored in local storage.\n\nYou can run the app locally and see how it performs. Follow the below steps to run the app locally.\nClone the repo\ngit clone https://github.com/hellomuthu23/react-material-ui-template.git\n\nRun yarn command to install the required npm package.\nRun yarn start to start the app.\nAccess the app at http://localhost:3000.\nHope you like this cool template and is of use to you!.\nGithub: https://github.com/hellomuthu23/react-material-ui-template\nhttps://react-material-ui-template.web.app/",
          "link": "https://dev.to/hellomuthu23/react-and-material-ui-landing-page-template-starter-kit-kanban-taskboard-webapp-544i",
          "publishedOn": "2021-06-23T21:51:59.000Z",
          "wordCount": 634,
          "title": "React and Material-UI Landing Page/Template Starter Kit — Kanban Taskboard WebApp"
        },
        {
          "id": "https://dev.to/cesd/how-i-built-an-incomplete-cms-4fbn",
          "author": "Ces-D",
          "description": "I began building a blog application for a site that I may or may not finish. The bulk of the project is based on the blog-starter-typescript example in the NextJs GitHub repo. Their example loads markdown files from a folder in the root directory and uses remark and gray-matter to convert the markdown into html and to get file metadata. The example code for these function is located in their lib folder as api.ts and markdownToHtml.ts. \nThe system they used works very well, however, if you plan on creating many posts and incorporating many images then that is when the system begins to breakdown. Since you store all of the markdown files and images in your root directory then it will perpetually grow and hosting costs for packages that large are affected. This is where I was looking for a so…",
          "link": "https://dev.to/cesd/how-i-built-an-incomplete-cms-4fbn",
          "publishedOn": "2021-06-23T17:49:28.000Z",
          "wordCount": 1090,
          "title": "How I Built An Incomplete CMS"
        },
        {
          "id": "https://dev.to/riyanegi/getting-started-with-typescript-with-react-hooks-2021-5cfd",
          "author": "RiyaNegi",
          "description": "Typescript is the next big thing in the Front End Development domain and if you are looking to upgrade your skills from a junior to an intermediate frontend developer, then it is a must have skill.\nThis article is for developers who already know react and javascript and want to shift to typescript, so I won't be focusing on any react concepts. This is a crash course on understanding the basics of using Typescript with React.\n\nWe will be covering all the topics necessary for understanding the basics of using react with typescript.\nInfo\nSetup\nHandling State\nHandling Props\nHandling Functions\nHandling Events\nIn this article we will be building a simple personal watch list that records the movies you input by taking it's name, rating and review. It looks something like.(It is a little stylised …",
          "link": "https://dev.to/riyanegi/getting-started-with-typescript-with-react-hooks-2021-5cfd",
          "publishedOn": "2021-06-23T17:26:43.000Z",
          "wordCount": 1965,
          "title": "Getting started with Typescript with React Hooks [2021]"
        },
        {
          "id": "https://dev.to/typescripttv/6-ways-to-configure-webpack-5a33",
          "author": "Benny Neugebauer",
          "description": "Webpack is a build tool to make code, which was not primarily written for execution in browsers, executable in web browsers. With special plugins, webpack can manage many types of code, for example JavaScript, TypeScript, and Rust-generated WebAssembly.\nThere are webpack plugins to also compile, minify, shim, chunk, and bundle code. However, webpack was not designed to execute tasks such as linting, building, or testing your app. For this purpose, there are task runners such as Grunt, Gulp or npx.\nIn order to manage the functionality of webpack, it must be configured. Here are six different ways, in which webpack's configuration can be written.\nAs of webpack version 4, you are not required to specify a configuration. By default, webpack assumes that your code starts at src/index.js and wil…",
          "link": "https://dev.to/typescripttv/6-ways-to-configure-webpack-5a33",
          "publishedOn": "2021-06-23T15:04:47.000Z",
          "wordCount": 1300,
          "title": "6 ways to configure Webpack"
        },
        {
          "id": "https://dev.to/m_ahmad/let-s-build-airbnb-home-page-with-nextjs-and-chakraui-part-3-final-3379",
          "author": "Muhammad  Ahmad",
          "description": "In this part, We'll continue with main section and then we'll create footer.\nGithub Repo: Chakra-airbnb\nDemo: Chakra-airbnb\n\n <Heading\n        as=\"h3\"\n        fontSize=\"1.5rem\"\n        fontWeight=\"bold\"\n        textAlign=\"left\"\n        mb={{ base: \"4\", lg: \"2\" }}\n        pb={4}\n        borderBottom=\"1px solid\"\n        borderColor=\"gray.300\"\n      >\n        Traveling with AirBnb\n      </Heading>\n      <Flex\n        as=\"section\"\n        alignItems=\"start\"\n        justify=\"between\"\n        flexDirection={{ base: \"column\", lg: \"row\" }}\n        my={{ base: \"1.5rem\", lg: \"2.5rem\" }}\n        borderBottom=\"1px solid\"\n        borderColor=\"gray.300\"\n        pb={8}\n      >\n        <Box\n          w={{ base: \"100%\", lg: 1 / 3 }}\n          px={{ lg: \"0.5rem\" }}\n          mb={{ base: \"6\", lg: \"0\" }}\n    …",
          "link": "https://dev.to/m_ahmad/let-s-build-airbnb-home-page-with-nextjs-and-chakraui-part-3-final-3379",
          "publishedOn": "2021-06-23T13:11:15.000Z",
          "wordCount": 1201,
          "title": "Let's build Airbnb Home page with Nextjs and ChakraUI - Part 3(final)"
        },
        {
          "id": "https://dev.to/p42/p42-for-visual-studio-code-1k8o",
          "author": "Lars Grammel",
          "description": "P42 for Visual Studio Code is now available in the Visual Studio Marketplace. \nfree extension includes all refactorings and code modernizations that are available in P42. It can be used on all repositories and runs entirely locally.\nWhen you open a JavaScript or TypeScript file, P42 will automatically detect code that could be modernized and highlight it:\n\nYou can then effortlessly update your code using the Quick Fix function. \nWith P42 for Visual Studio Code, you can learn new JavaScript patterns right in your IDE, make sure new code follows best practices, and modernize older code gradually.\nTry out P42 for Visual Studio Code today!",
          "link": "https://dev.to/p42/p42-for-visual-studio-code-1k8o",
          "publishedOn": "2021-06-23T09:09:49.000Z",
          "wordCount": 930,
          "title": "P42 for Visual Studio Code"
        },
        {
          "id": "https://dev.to/applicazza/serve-next-js-with-fastify-5e67",
          "author": "applicazza",
          "description": "In case you ever wondered how to integrate Fastify with Next.js and let latter be a part of Fastify's lifecycle this short guide is for you.\nAs you may know, Next.js has limited public API that does not provide anything that would return response as string or object. Moreover, Next.js writes response directly to stream that is being sent to the client.\nWhat if we want to maintain session and attach or detach cookies that are being handled with Fastify when serving Next.js content?\nNode.Js Proxy to the resque!\nLet's write a simple plugin that will wrap  http.IncomingMessage and http.ServerResponse and forward necessary calls to Fastify.\nFirst, let's augment Fastify instance as well as http.IncomingMessage and http.OutgoingMessage interfaces with methods and properties that we want to be ava…",
          "link": "https://dev.to/applicazza/serve-next-js-with-fastify-5e67",
          "publishedOn": "2021-06-23T08:44:07.000Z",
          "wordCount": 1012,
          "title": "Serve Next.js with Fastify"
        },
        {
          "id": "https://dev.to/maddevs/quick-start-with-typescript-and-react-517f",
          "author": "Mad Devs",
          "description": "Currently, the React+Typescript is considered as one of the most popular bundles for creating client-side applications. This combination has a huge potential and allows to develop solutions of any complexity. In this article, we’ll see why Typescript is so hyped, discuss some basic examples of working with components, storages, and API queries, and see the benefits of Typescript.\nTable of contents\nIntroduction\nReact\nTypescript\nProject creation\nComponents\nStore\nAPI\nProps of Typescript\nConst of Typescript\nConclusion\nI assume that all readers know about React. Otherwise, it is pointless to proceed reading the article. To enthusiastic non-reacters please go to read the doc and then come back here.\nTypeScript(TS) is a typed superset of JavaScript(JS) that provides compile-time checking of sourc…",
          "link": "https://dev.to/maddevs/quick-start-with-typescript-and-react-517f",
          "publishedOn": "2021-06-23T05:09:56.000Z",
          "wordCount": 3018,
          "title": "Quick start with Typescript and React"
        },
        {
          "id": "https://dev.to/keyurparalkar/handling-errors-gracefully-in-react-with-error-boundaries-1n32",
          "author": "Keyur Paralkar",
          "description": "Prerequisites to implement Error boundaries in React\n\n\n\nUnderstanding of error types such as run-time, and compile-time errors.\nKnowledge of Class based components.\nAn sentry account for logging errors\nArchitectural design pattern for implementing error boundaries in react.\nImplementation of error boundary from scratch.\nTypes of errors catched by error boundaries.\nCommon problems faced during the usage of react error boundary.\nreact-error-boundary to the rescue.\nImplementation of third-party error logging tools such as sentry.\nIn react, all the error boundaries are made up of class based components.\nError boundaries are some of the graceful ways using which you can catch errors in a more efficient way.\nYou can consider it as a try and catch blocks of JSX ecosystem.\nBelow is a simple exampl…",
          "link": "https://dev.to/keyurparalkar/handling-errors-gracefully-in-react-with-error-boundaries-1n32",
          "publishedOn": "2021-06-23T03:52:57.000Z",
          "wordCount": 2078,
          "title": "Handling errors gracefully in react with error boundaries"
        },
        {
          "id": "https://dev.to/jonocairns/mono-repository-with-typescript-and-yarn-workspaces-45m4",
          "author": "Jono Cairns",
          "description": "Monoliths have their place in many systems. Usually they stem from ease of use, allowing cross cutting changes to be done in a single pull request. They also have a lot of downsides, but that’s a whole other can of worms.\nHere are the main points we had trouble with in our monolith:\nHow do you share code between sub-projects?\nHow do you manage typescript compilation for dependant projects? E.g. if a depends on b and I make a change to a, I want b to be compiled as well with the latest version of a.\nThis was an example of my repository structure:\nprojectA/\nprojectB/\nprojectC/\npackages/\n\nInside my packages/ directory I had some core shared libraries, like types / shared utils etc.\nOk — so how do you get it all to work together?\nSince we were already using yarn, it seemed like yarn workspaces…",
          "link": "https://dev.to/jonocairns/mono-repository-with-typescript-and-yarn-workspaces-45m4",
          "publishedOn": "2021-06-23T00:02:35.000Z",
          "wordCount": 812,
          "title": "Mono-repository with typescript and yarn workspaces"
        },
        {
          "id": "https://dev.to/samuelmpinho/how-to-think-your-application-with-relay-2lpo",
          "author": "Samuel Monteiro",
          "description": "Introduction\n\n\n\n  \n  \n  First impression\n\n\nI didn't have a good first impression about Relay when I've started using it. I found it difficult to understand, verbose to use, and I didn't saw the benefits from it.\nEven though I didn't like it, I was part of a team, and as a team we choose to stick with Relay and see in the long term if it was a good choice or not.\nAs the time goes by, I've started to get along with it and to understand how to use it. I still didn't have the full idea, but just to realize how I could use it to solve simple problems like data fetching, and to know what I was doing was enough for me at the time.\nMonths later, I was promoted to tech lead and with that came the responsibility to understand and to explain to my team why we're using the stuff that we're using. I ha…",
          "link": "https://dev.to/samuelmpinho/how-to-think-your-application-with-relay-2lpo",
          "publishedOn": "2021-06-22T23:16:28.000Z",
          "wordCount": 1762,
          "title": "How to think your application with Relay"
        },
        {
          "id": "https://dev.to/stereobooster/react-hook-to-select-multiple-items-with-a-shift-26o1",
          "author": "stereobooster",
          "description": "Imagine you have a list (or a table) with checkboxes, for example, to do list, mail inbox, or “back-office” page. Checkboxes are used to select items for batch actions, for example, delete or archive, etc.\nCode can look like this:\nconst { selected, change } = useSelected([] as Array<Item>);\n\nreturn (\n  <ul>\n    {items.map((item) => (\n      <li key={item.id}>\n        <label>\n          <input\n            type=\"checkbox\"\n            id={item.id}\n            checked={selected.includes(item)}\n            onChange={(event) => change(event.target.checked, [item])}\n          />\n          {item.name}\n        </label>\n      </li>\n    ))}\n  </ul>\n);\n\nIt is a nice UX trick to allow to select multiple items with shift:\nuser clicks on checkbox “A”\nuser clicks on checkbox “Z” while holding down Shift key…",
          "link": "https://dev.to/stereobooster/react-hook-to-select-multiple-items-with-a-shift-26o1",
          "publishedOn": "2021-06-22T21:16:31.000Z",
          "wordCount": 768,
          "title": "React hook to select multiple items with a shift"
        }
      ]
    }
  ],
  "cliVersion": "1.11.0"
}